[
{"title": "Development Manager- Integrated Sports", "job_posted": "Aug 7, 2017", "job_location": "Vancouver, BC, CA, V5Y 3T9", "province_name": "BC", "job_detail": "<div class=\"job\"><span itemprop=\"description\"><p>At Rogers we’re for supporting you on a journey to a rewarding career. Whether you’re a developer, an analyst, or a customer care consultant, Rogers is the place where ideas become reality. We embrace change, and find ways to do better. And we deliver on that commitment by fostering an environment of passion and innovation for all people.</p><p> </p><p>The Manger, Development – Sports &amp; NHL is responsible for driving media sales growth across all platforms through the creation of integrated solutions for our partners (agencies and advertisers) and strategic sponsorship opportunities for the western market. </p><p>This role will be part of but not limited to the Rogers Sports Sales team reporting directly to Director, Integrated Sales – Sports &amp; NHL and is based in Vancouver B.C. This role will also work cross-functionally to support various sales teams across Rogers Media.  This individual will help conceive ideas, gather assets, create engaging sales material and support sales in presenting solutions to agencies and advertisers.  They must understand Sportsnet’ s content, rights and how we can monetize all available platforms within the boundaries of secured agreements. They must establish productive relationships with internal Sportsnet areas, including Content, Media Planning Inventory and Consumer Marketing.  They should model an energetic, positive attitude that helps build and foster a “winning team” environment.</p><p>Responsibilities:</p><p><u>Planning and Strategy</u></p><ul><li>Work with Content, Marketing &amp; Brand and MPI on annual sales plans for all properties across the various platforms.</li><li>Evaluate and translate property rights across platforms into selling guidelines by property in tandem with MPI team.</li><li>Manage and maintain annual sales calendar with go-to-market timelines.</li><li>Conduct semi-annual competitive analysis on best practices in branded content/media from around the world – with emphasis on sports properties.</li><li>Provide initiative on new and existing business opportunities</li><li>Ensure timely and accurate information is distributed to sales relevant group(s)</li></ul><p> </p><p><u>Outbound Initiatives</u></p><ul><li>Responsible to create/build/complete “market ready” outbound integrated/multi-platform customer-ready proposals &amp; roadshows with a specific focus on the western market,</li><li>Ensure outbound opportunity planning and execution cycle is aligned to customer planning and buying windows.</li><li>Work closely with MPI, Consumer Insights, Marketing, Production and other areas to ensure Sportsnet delivers compelling opportunities to our customers.</li><li>Become the voice of sales &amp; customer with internal groups - ensuring pricing, packaging and content integration will align with market needs/planning.</li></ul><p> </p><p><u>Inbound RFPs</u></p><ul><li>Responsible for the creative response for all qualified Sportsnet “RFP’s” (request for proposal).</li><li>This includes ideation (concept creation), preparation of the proposal including the marketing of the proposal.</li><li>Must prioritize all RFP’s and set up appropriate meetings and brainstorms with the internal groups.</li><li>Summarizes creative concepts and seek approval from content leads and work with MPI on pricing and category concerns.</li><li>Develop supporting work-back schedules and mock-ups to help provide a “turn-key” solution for our customers.</li><li>Create the final customer PowerPoint presentation/sales materials, ensuring customer objectives are met, creative concepts are articulated clearly and include supporting research/creative/sales tools (if required).</li><li>Be available to present the final solution with sales lead as required.</li></ul><p> </p><p><u>Reporting and Analysis</u></p><ul><li>Maintain revenue tracking by against each “outbound” property as deals close.</li><li>Track of all in-bound RFPs with details including customer, deal revenue, annual increase (if applicable) and other feedback.</li><li>Provides post-analysis of key outbound and inbound customer programs</li></ul><p> </p><p><u>Other Responsibilities</u></p><p> </p><ul><li>Travel to various client meetings, onsite production, client hosting and etc. as needed</li><li>Schedule regular reporting meetings and updates with the Director, Integrated Sales – Sports &amp; NHL</li><li>Other duties as required</li></ul><p> </p><p>Qualifications:</p><ul><li>Core Competencies: Customer Focus; Teamwork; Communication; Accountability; Innovation.</li><li>Post-secondary degree or diploma</li><li>4-6 years of related work experience in an integrated sales and sponsorship marketing capacity</li><li>Knowledge of MS Office applications</li><li>Able to multi-task in a fast paced environment</li><li>Highly motivated individual with excellent interpersonal and communication skills.</li><li>Strong organizational skills</li></ul><div> </div><div><b>Schedule:</b> Full Time</div><div><b>Shift:</b> Day</div><div><b>Length of Contract:</b> Not Applicable (Regular Position)</div><div><b>Work Location: </b>180 West 2nd Avenue (810), Vancouver, BC </div><div><b>Travel Requirements:</b> Up to 25%</div><div><b>Posting Category/Function: </b>Sales &amp; Account Management</div><div><b>Requisition ID:</b> 104806</div><div> </div><div><b>WHY ROGERS?</b></div><div> </div><div>As a proud Canadian company, we're dedicated to making things easier for our customers. We’ve been embracing and leading change for over 50-years, and we’ll continue to seek out new opportunities to bring our customers simple solutions for today and tomorrow.</div><div> </div><div>We recognize that success is determined by the strength and diversity of our people. We work together because we want to win together, and these five shared values guide and define our work:</div><div> </div><ol><li>Simplify and innovate</li><li>Take ownership of the what and the how</li><li>Equip people to succeed</li><li>Execute with discipline and pride</li><li>Talk straight, build trust, and over deliver</li></ol><div> </div><div>Why Rogers?  Because your tomorrow inspires our today.</div><div> </div><div>What makes us different makes us stronger. Rogers has a strong commitment to diversity and inclusion. Everyone who applies for a job will be considered.</div><div> </div><div><i>We recognize the business value in creating a workplace where each team member has the tools to reach their full potential. At Rogers, we value the insights and innovation that diverse teams bring to work. We work with our candidates with disabilities throughout the recruitment process to ensure that they have what they need to be at their best. Please reach out to our recruiters and hiring managers to begin a conversation about how we can ensure that you deliver your best work. You can also reach out to our team at <a href=\"mailto:RogersRecruiting@rci.rogers.com\">RogersRecruiting@rci.rogers.com</a></i> to begin a conversation about your individual accessibility needs throughout the hiring process.</div><div> </div><div>Posting Notes:  Sales || Canada (CA) || BC || Vancouver || SF:LI ||</div><p> </p></span><p class=\"job-location\"><span class=\"jobmarkets\"></span></p></div>"},
{"title": "Angular Developer", "job_posted": "Aug 4, 2017", "job_location": "Toronto, ON, CA, M4Y 2Y5", "province_name": "ON", "job_detail": "<div class=\"job\"><span itemprop=\"description\"><div>Every day, we strive to build a brilliant digital future for Canadians. We work as one team, with one goal – serve our customers better.</div><div> </div><p>Imagine working for an exciting entrepreneurial company whose employees are committed to meeting the big challenges and making a real difference. That’s Rogers. A leading communications and media company where people come to do great work. Right now we are looking for talented individuals to join our winning team where you will have a chance to innovate, grow and to do what really matters. This role will be primarily based Downtown but may expand to Brampton office.</p><p> </p><p>We are currently seeking unusually talented and highly versatile front-end developers who live and breathe HTML 5, CSS and JavaScript and either love or are willing to try a long term relationship with Angular.js or React.js, with a bit of dabbling in other JavaScript frameworks from time to time. You ideally believe that single page applications are the future of Digital and are eager to work with server side developers to ensure they produce well designed REST services for you to consume. We strongly value deep technical skills, an eye for UI design and UX intuition, willingness to learn, and desire to work in an intensive, highly productive environment.</p><p> </p><p><strong>Primary Function:</strong></p><p> </p><p>Develop interactive web applications (in a CMS or single page applications) that include browse, shop and self-service functions and customer friendly capabilities.  A key responsibility is to use your creativity to produce highly responsive and enjoyable web-based user interfaces.  The customer should never be confused about what is happening or become frustrated because they don’t know what to do next.</p><p> </p><p><strong>Detailed Responsibilities include:</strong></p><p> </p><p>- Creating highly interactive single page applications using Angular.js and React.js that respond to all user actions in fractions of a second</p><p>- Creating attractive experiences in content management that delight and inspire the customer</p><p>- Creating, maintaining, debugging and optimizing JavaScript, HTML and CSS</p><p>- Taking an active role in structuring our single page applications to make them easy to maintain and to ensure they are highly modularized</p><p>- Creating optimized HTML, CSS and JavaScript with breakpoints that work well on mobile browsers</p><p>- Working closely the architects and back end services team to ensure that that we have a useful set of REST services</p><p>- Working closely with UX and UI designers to help them understand the constraints of single page applications and development frameworks so that they produce usable designs</p><p> </p><p><strong>Qualifications</strong></p><p> </p><p>- A university degree in arts, design, engineering, science, math or computer science is highly desirable</p><p>- Experience in JavaScript, jQuery, CSS 3, and HTML 5 and in optimizing for fast rendering</p><p>- 5+ years experience in building mobile responsive pages with JavaScript frameworks</p><p>- Experience with Social Media APIs (Facebook, Twitter, etc)</p><p>- Development using Scrum Agile methodologies is a plus</p><p>- Demonstrated ability to create single page applications, either through prior experience, school projects or special websites you have built to showcase your skills</p><p>- You truly love to code and build Digital experiences as evidenced by prior projects and experience</p><p>- Strong organizational and estimation skills</p><p>- Exceptional communications and presentation skills</p><p> </p><div><strong>Schedule:</strong> Full Time</div><div><strong>Shift:</strong> Day</div><div><strong>Length of Contract:</strong> Not Applicable (Regular Position)</div><div><strong>Work Location: </strong>1 Mount Pleasant (083), Toronto, ON </div><div><strong>Travel Requirements:</strong> Up to 10%</div><div><strong>Posting Category/Function: </strong>Technology &amp; Information Technology</div><div><strong>Requisition ID:</strong> 102788</div><div> </div><div><b>WHY ROGERS?</b></div><div> </div><div>As a proud Canadian company, we're dedicated to making things easier for our customers. We’ve been embracing and leading change for over 50-years, and we’ll continue to seek out new opportunities to bring our customers simple solutions for today and tomorrow.</div><div> </div><div>At Rogers, we recognize that success is determined by the strength and diversity of our people. We work together because we want to win together, and these five shared values guide and define our work:</div><div> </div><ol><li>Simplify and innovate</li><li>Take ownership of the what and the how</li><li>Equip people to succeed</li><li>Execute with discipline and pride</li><li>Talk straight, build trust, and over deliver</li></ol><div> </div><div>Why Rogers? Because we believe the best is yet to come.</div><div> </div><div><em>We recognize the business value in creating a workplace where each team member has the tools to reach their full potential. At Rogers, we value the insights and innovation that diverse teams bring to work. We work with our candidates with disabilities throughout the recruitment process to ensure that they have what they need to be at their best. Please reach out to our recruiters and hiring managers to begin a conversation about how we can ensure that you deliver your best work. You can also reach out to our team at <a href=\"mailto:RogersRecruiting@rci.rogers.com\">RogersRecruiting@rci.rogers.com</a> to begin a conversation about your individual accessibility needs throughout the hiring process.</em></div><div> </div><div>Posting Notes:  Information Technology &amp; Engineering || Canada (CA) || ON || Toronto || SF:LI-LW1 ||</div><p> </p></span><p class=\"job-location\"><span class=\"jobmarkets\"></span></p></div>"},
{"title": "Sales Associate - Fido - King East", "job_posted": "Aug 4, 2017", "job_location": "Toronto, ON, CA, M5A 3X5", "province_name": "ON", "job_detail": "<div class=\"job\"><span itemprop=\"description\"><p>At Rogers we’re for supporting you on a journey to a rewarding career. Whether you’re a developer, an analyst, or a customer care consultant, Rogers is the place where ideas become reality. We embrace change, and find ways to do better. And we deliver on that commitment by fostering an environment of passion and innovation for all people.</p><p> </p><p>Our Sales Associates don’t just embrace the latest technology and content – it’s part of who they are. We want people on our team who are excited about our products and services and want to share their knowledge and experience with others. At Fido, retail has impact, and so can you.</p><p>We’re looking for outgoing, approachable sales associates with a proven track record in sales to join our Fido King East store on a part time basis. You’ll build and establish customer relationships, own the resolution of customer issues, and act as a Fido ambassador</p><p><strong>Your Experience</strong></p><ul><li>Proven success in a sales role, ideally within telecommunications, technology or retail</li><li>A sales professional with an ability to achieve individual sales targets</li><li>A passion for delivering exceptional customer service and sales experience</li><li>Tech savvy and eager to learn about technology and the telecom industry</li><li>An ability to think outside of the box and work in a fast-paced retail sales role</li><li>A proactive team player</li><li>Additional languages are an asset</li><li>An ability to work a varied and flexible schedule (20-30 hours per week, Monday – Sunday)</li></ul><p><strong>Benefits for You</strong></p><ul><li>Base hourly rate and competitive commission structure</li><li>Flexible schedule</li><li>Comprehensive health and dental plan for full time and part time employees</li><li>Outstanding share options and wealth accumulation programs</li><li>Employee discounts across Rogers &amp; Fido services</li><li>A company committed to investing in and developing our own talent</li><li>Employee recognition programs</li><li>Overtime pay eligible</li></ul><p><strong>As part of the recruitment process, candidates will be required to provide consent for and successfully pass a criminal background check.</strong></p><div> </div><div><b>Schedule:</b> Part Time</div><div><b>Shift:</b> Variable</div><div><b>Length of Contract:</b> Not Applicable (Regular Position)</div><div><b>Work Location: </b>333 King St. E, UNIT 110 (5309), Toronto, ON </div><div><b>Travel Requirements:</b> None</div><div><b>Posting Category/Function: </b>Retail (In Store / Hourly) &amp; Sales and Service</div><div><b>Requisition ID:</b> 104053</div><div> </div><div><b>WHY ROGERS?</b></div><div> </div><div>As a proud Canadian company, we're dedicated to making things easier for our customers. We’ve been embracing and leading change for over 50-years, and we’ll continue to seek out new opportunities to bring our customers simple solutions for today and tomorrow.</div><div> </div><div>We recognize that success is determined by the strength and diversity of our people. We work together because we want to win together, and these five shared values guide and define our work:</div><div> </div><ol><li>Simplify and innovate</li><li>Take ownership of the what and the how</li><li>Equip people to succeed</li><li>Execute with discipline and pride</li><li>Talk straight, build trust, and over deliver</li></ol><div> </div><div>Why Rogers?  Because your tomorrow inspires our today.</div><div> </div><div>What makes us different makes us stronger. Rogers has a strong commitment to diversity and inclusion. Everyone who applies for a job will be considered.</div><div> </div><div><i>We recognize the business value in creating a workplace where each team member has the tools to reach their full potential. At Rogers, we value the insights and innovation that diverse teams bring to work. We work with our candidates with disabilities throughout the recruitment process to ensure that they have what they need to be at their best. Please reach out to our recruiters and hiring managers to begin a conversation about how we can ensure that you deliver your best work. You can also reach out to our team at <a href=\"mailto:RogersRecruiting@rci.rogers.com\">RogersRecruiting@rci.rogers.com</a></i> to begin a conversation about your individual accessibility needs throughout the hiring process.</div><div> </div><div>Posting Notes:  Retail || Canada (CA) || ON || Toronto || Retail ||</div><p> </p></span><p class=\"job-location\"><span class=\"jobmarkets\"></span></p></div>"},
{"title": "Senior Director, The Shopping Channel", "job_posted": "Aug 4, 2017", "job_location": "Mississauga, ON, CA, L5T 2P9", "province_name": "ON", "job_detail": "<div class=\"job\"><span itemprop=\"description\"><div>Every day, we strive to build a brilliant digital future for Canadians. We work as one team, with one goal –serve our customers better.</div><div> </div><p style=\"margin: 0cm 0cm 0pt;\"><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \">The Shopping Channel is a division of Rogers Broadcasting Limited (a subsidiary of Rogers Media Inc.) </span></p><p style=\"margin: 0cm 0cm 0pt;\"><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \">The Shopping Channel is currently seeking an experienced and dynamic leader to fill the role of Senior Director, IT. Reporting to the VP Media IT, you will be responsible for all items related to IT as TSC including: strategy, solution development, broadcast engineering and operations, project execution, technical implementation, and IT operations and support. You will be responsible for developing and implementing a number of IT solutions that generate to the overall business’s goals of achieving its expected revenue growth and cost efficiencies. In addition, the incumbent is responsible for addressing operational challenges which are related to aging and costly IT infrastructure, PCI compliance and legacy application systems.</span></p><p style=\"margin: 0cm 0cm 0pt;\"><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \"> </span></p><p style=\"margin: 0cm 0cm 0pt;\"><b><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \">Primary Accountabilities:</span></b></p><p style=\"margin: 0cm 0cm 0pt;\"><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \"> </span></p><p style=\"margin: 0cm 0cm 0pt; text-indent: -18pt;\"><span style=\"color: black; font-family: Symbol; font-size: 10pt;\">·</span><span 7pt;\"=\"\" font-size:=\"\" new=\"\" roman\",serif;=\"\" style=\"color: black; font-family: \" times=\"\">       </span><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \">Develop and implement strategic and operational plan for TSC Technology</span></p><p style=\"margin: 0cm 0cm 0pt; text-indent: -18pt;\"><span style=\"color: black; font-family: Symbol; font-size: 10pt;\">·</span><span 7pt;\"=\"\" font-size:=\"\" new=\"\" roman\",serif;=\"\" style=\"color: black; font-family: \" times=\"\">       </span><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \">Deliver Opex and Capex target</span></p><p style=\"margin: 0cm 0cm 0pt; text-indent: -18pt;\"><span style=\"color: black; font-family: Symbol; font-size: 10pt;\">·</span><span 7pt;\"=\"\" font-size:=\"\" new=\"\" roman\",serif;=\"\" style=\"color: black; font-family: \" times=\"\">       </span><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \">Ensure efficient, stable and secure TSC IT and Broadcast Technology systems</span></p><p style=\"margin: 0cm 0cm 0pt; text-indent: -18pt;\"><span style=\"color: black; font-family: Symbol; font-size: 10pt;\">·</span><span 7pt;\"=\"\" font-size:=\"\" new=\"\" roman\",serif;=\"\" style=\"color: black; font-family: \" times=\"\">       </span><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \">Manage delivery of TSC technology related initiatives</span></p><p style=\"margin: 0cm 0cm 0pt; text-indent: -18pt;\"><span style=\"color: black; font-family: Symbol; font-size: 10pt;\">·</span><span 7pt;\"=\"\" font-size:=\"\" new=\"\" roman\",serif;=\"\" style=\"color: black; font-family: \" times=\"\">       </span><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \">Develop talent and promote employee engagement</span></p><p style=\"margin: 0cm 0cm 0pt; text-indent: -18pt;\"><span style=\"color: black; font-family: Symbol; font-size: 10pt;\">·</span><span 7pt;\"=\"\" font-size:=\"\" new=\"\" roman\",serif;=\"\" style=\"color: black; font-family: \" times=\"\">       </span><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \">Communicate and promote both the ITS and TSC goals and objectives</span></p><p style=\"margin: 0cm 0cm 0pt 18pt;\"><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \"> </span></p><p style=\"margin: 0cm 0cm 0pt;\"><b><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \">Specific Tasks:</span></b></p><p style=\"margin: 0cm 0cm 0pt; text-indent: -18pt;\"><span style=\"color: black; font-family: Symbol; font-size: 10pt;\">·</span><span 7pt;\"=\"\" font-size:=\"\" new=\"\" roman\",serif;=\"\" style=\"color: black; font-family: \" times=\"\">       </span><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \">Develop and deliver mid-long term TSC IT Strategy and roadmap and ensure alignment with overall ITS technology strategy</span></p><p style=\"margin: 0cm 0cm 0pt; text-indent: -18pt;\"><span style=\"color: black; font-family: Symbol; font-size: 10pt;\">·</span><span 7pt;\"=\"\" font-size:=\"\" new=\"\" roman\",serif;=\"\" style=\"color: black; font-family: \" times=\"\">       </span><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \">Ensure that IT Operations is in alignment with TSC business requirements</span></p><p style=\"margin: 0cm 0cm 0pt; text-indent: -18pt;\"><span style=\"color: black; font-family: Symbol; font-size: 10pt;\">·</span><span 7pt;\"=\"\" font-size:=\"\" new=\"\" roman\",serif;=\"\" style=\"color: black; font-family: \" times=\"\">       </span><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \">Deliver in-year and longer term technology initiatives</span></p><p style=\"margin: 0cm 0cm 0pt; text-indent: -18pt;\"><span style=\"color: black; font-family: Symbol; font-size: 10pt;\">·</span><span 7pt;\"=\"\" font-size:=\"\" new=\"\" roman\",serif;=\"\" style=\"color: black; font-family: \" times=\"\">       </span><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \">Deliver on Opex and Capex budget</span></p><p style=\"margin: 0cm 0cm 0pt; text-indent: -18pt;\"><span style=\"color: black; font-family: Symbol; font-size: 10pt;\">·</span><span 7pt;\"=\"\" font-size:=\"\" new=\"\" roman\",serif;=\"\" style=\"color: black; font-family: \" times=\"\">       </span><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \">Deliver on Opex efficiencies</span></p><p style=\"margin: 0cm 0cm 0pt; text-indent: -18pt;\"><span style=\"color: black; font-family: Symbol; font-size: 10pt;\">·</span><span 7pt;\"=\"\" font-size:=\"\" new=\"\" roman\",serif;=\"\" style=\"color: black; font-family: \" times=\"\">       </span><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \">Deliver on capitalized labour targets</span></p><p style=\"margin: 0cm 0cm 0pt; text-indent: -18pt;\"><span style=\"color: black; font-family: Symbol; font-size: 10pt;\">·</span><span 7pt;\"=\"\" font-size:=\"\" new=\"\" roman\",serif;=\"\" style=\"color: black; font-family: \" times=\"\">       </span><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \">Proactive management of TSC applications</span></p><p style=\"margin: 0cm 0cm 0pt; text-indent: -18pt;\"><span style=\"color: black; font-family: Symbol; font-size: 10pt;\">·</span><span 7pt;\"=\"\" font-size:=\"\" new=\"\" roman\",serif;=\"\" style=\"color: black; font-family: \" times=\"\">       </span><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \">Develop application upgrade path for legacy systems</span></p><p style=\"margin: 0cm 0cm 0pt; text-indent: -18pt;\"><span style=\"color: black; font-family: Symbol; font-size: 10pt;\">·</span><span 7pt;\"=\"\" font-size:=\"\" new=\"\" roman\",serif;=\"\" style=\"color: black; font-family: \" times=\"\">       </span><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \">Immediate response, resolution and communication</span></p><p style=\"margin: 0cm 0cm 0pt; text-indent: -18pt;\"><span style=\"color: black; font-family: Symbol; font-size: 10pt;\">·</span><span 7pt;\"=\"\" font-size:=\"\" new=\"\" roman\",serif;=\"\" style=\"color: black; font-family: \" times=\"\">       </span><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \">Govern execution of TSC IT initiatives</span></p><p style=\"margin: 0cm 0cm 0pt; text-indent: -18pt;\"><span style=\"color: black; font-family: Symbol; font-size: 10pt;\">·</span><span 7pt;\"=\"\" font-size:=\"\" new=\"\" roman\",serif;=\"\" style=\"color: black; font-family: \" times=\"\">       </span><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \">Ensure requirements are clear and managed effectively</span></p><p style=\"margin: 0cm 0cm 0pt; text-indent: -18pt;\"><span style=\"color: black; font-family: Symbol; font-size: 10pt;\">·</span><span 7pt;\"=\"\" font-size:=\"\" new=\"\" roman\",serif;=\"\" style=\"color: black; font-family: \" times=\"\">       </span><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \">Support teams and remove road blocks on programs</span></p><p style=\"margin: 0cm 0cm 0pt; text-indent: -18pt;\"><span style=\"color: black; font-family: Symbol; font-size: 10pt;\">·</span><span 7pt;\"=\"\" font-size:=\"\" new=\"\" roman\",serif;=\"\" style=\"color: black; font-family: \" times=\"\">       </span><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \">Manage talent and performance for direct reports</span></p><p style=\"margin: 0cm 0cm 0pt; text-indent: -18pt;\"><span style=\"color: black; font-family: Symbol; font-size: 10pt;\">·</span><span 7pt;\"=\"\" font-size:=\"\" new=\"\" roman\",serif;=\"\" style=\"color: black; font-family: \" times=\"\">       </span><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \">Support personal development plans</span></p><p style=\"margin: 0cm 0cm 0pt; text-indent: -18pt;\"><span style=\"color: black; font-family: Symbol; font-size: 10pt;\">·</span><span 7pt;\"=\"\" font-size:=\"\" new=\"\" roman\",serif;=\"\" style=\"color: black; font-family: \" times=\"\">       </span><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \">Promote ITS goals and objectives and benefits to TSC</span></p><p style=\"margin: 0cm 0cm 0pt; text-indent: -18pt;\"><span style=\"color: black; font-family: Symbol; font-size: 10pt;\">·</span><span 7pt;\"=\"\" font-size:=\"\" new=\"\" roman\",serif;=\"\" style=\"color: black; font-family: \" times=\"\">       </span><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \">Communicate / educate TSC SLT on ITS processes and procedures</span></p><p style=\"margin: 0cm 0cm 0pt;\"><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \"> </span></p><p style=\"margin: 0cm 0cm 0pt;\"><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \">In order to be considered for this role you must possess the following qualifications and experiences:</span></p><p style=\"margin: 0cm 0cm 0pt;\"><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \"> </span></p><p style=\"margin: 0cm 0cm 0pt; text-indent: -18pt;\"><span style=\"color: black; font-family: Symbol; font-size: 10pt;\">·</span><span 7pt;\"=\"\" font-size:=\"\" new=\"\" roman\",serif;=\"\" style=\"color: black; font-family: \" times=\"\">       </span><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \">A seasoned leader with an Undergraduate degree in Business, Technology, Engineering;  Master’s degree is highly desirable with 10+ years in a leadership role.</span></p><p style=\"margin: 0cm 0cm 0pt; text-indent: -18pt;\"><span style=\"color: black; font-family: Symbol; font-size: 10pt;\">·</span><span 7pt;\"=\"\" font-size:=\"\" new=\"\" roman\",serif;=\"\" style=\"color: black; font-family: \" times=\"\">       </span><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \">7+ years’ experience in eCommerce and retail, in an analytical and/or website development function</span></p><p style=\"margin: 0cm 0cm 0pt; text-indent: -18pt;\"><span style=\"color: black; font-family: Symbol; font-size: 10pt;\">·</span><span 7pt;\"=\"\" font-size:=\"\" new=\"\" roman\",serif;=\"\" style=\"color: black; font-family: \" times=\"\">       </span><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \">Experience leading a high performing team of senior professionals.</span></p><p style=\"margin: 0cm 0cm 0pt; text-indent: -18pt;\"><span style=\"color: black; font-family: Symbol; font-size: 10pt;\">·</span><span 7pt;\"=\"\" font-size:=\"\" new=\"\" roman\",serif;=\"\" style=\"color: black; font-family: \" times=\"\">       </span><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \">Experience working with eCommerce software platforms and related platforms (search, etc.)</span></p><p style=\"margin: 0cm 0cm 0pt; text-indent: -18pt;\"><span style=\"color: black; font-family: Symbol; font-size: 10pt;\">·</span><span 7pt;\"=\"\" font-size:=\"\" new=\"\" roman\",serif;=\"\" style=\"color: black; font-family: \" times=\"\">       </span><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \">Working knowledge of HTML, CSS, Javascript</span></p><p style=\"margin: 0cm 0cm 0pt; text-indent: -18pt;\"><span style=\"color: black; font-family: Symbol; font-size: 10pt;\">·</span><span 7pt;\"=\"\" font-size:=\"\" new=\"\" roman\",serif;=\"\" style=\"color: black; font-family: \" times=\"\">       </span><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \">Experience working with and driving actionable insights from web analytics platforms such as Omniture and/or Google Analytics</span></p><p style=\"margin: 0cm 0cm 0pt; text-indent: -18pt;\"><span style=\"color: black; font-family: Symbol; font-size: 10pt;\">·</span><span 7pt;\"=\"\" font-size:=\"\" new=\"\" roman\",serif;=\"\" style=\"color: black; font-family: \" times=\"\">       </span><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \">Familiarity with usability testing methodologies and processes</span></p><p style=\"margin: 0cm 0cm 0pt; text-indent: -18pt;\"><span style=\"color: black; font-family: Symbol; font-size: 10pt;\">·</span><span 7pt;\"=\"\" font-size:=\"\" new=\"\" roman\",serif;=\"\" style=\"color: black; font-family: \" times=\"\">       </span><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \">Ability to execute against multiple projects and excel in a fast-paced, results-oriented work environment.</span></p><p style=\"margin: 0cm 0cm 0pt; text-indent: -18pt;\"><span style=\"color: black; font-family: Symbol; font-size: 10pt;\">·</span><span 7pt;\"=\"\" font-size:=\"\" new=\"\" roman\",serif;=\"\" style=\"color: black; font-family: \" times=\"\">       </span><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \">Demonstrated leadership skills in planning and execution</span></p><p style=\"margin: 0cm 0cm 0pt; text-indent: -18pt;\"><span style=\"color: black; font-family: Symbol; font-size: 10pt;\">·</span><span 7pt;\"=\"\" font-size:=\"\" new=\"\" roman\",serif;=\"\" style=\"color: black; font-family: \" times=\"\">       </span><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \">Strong analytical skills</span></p><p style=\"margin: 0cm 0cm 0pt; text-indent: -18pt;\"><span style=\"color: black; font-family: Symbol; font-size: 10pt;\">·</span><span 7pt;\"=\"\" font-size:=\"\" new=\"\" roman\",serif;=\"\" style=\"color: black; font-family: \" times=\"\">       </span><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \">Strong organizational, communication and presentation skills</span></p><p style=\"margin: 0cm 0cm 0pt; text-indent: -18pt;\"><span style=\"color: black; font-family: Symbol; font-size: 10pt;\">·</span><span 7pt;\"=\"\" font-size:=\"\" new=\"\" roman\",serif;=\"\" style=\"color: black; font-family: \" times=\"\">       </span><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \">Ability to easily understand and to be understood</span></p><p style=\"margin: 0cm 0cm 0pt; text-indent: -18pt;\"><span style=\"color: black; font-family: Symbol; font-size: 10pt;\">·</span><span 7pt;\"=\"\" font-size:=\"\" new=\"\" roman\",serif;=\"\" style=\"color: black; font-family: \" times=\"\">       </span><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \">Advanced leadership coaching and mentoring skills</span></p><p style=\"margin: 0cm 0cm 0pt; text-indent: -18pt;\"><span style=\"color: black; font-family: Symbol; font-size: 10pt;\">·</span><span 7pt;\"=\"\" font-size:=\"\" new=\"\" roman\",serif;=\"\" style=\"color: black; font-family: \" times=\"\">       </span><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \">Demonstrated business and financial acumen</span></p><p style=\"margin: 0cm 0cm 0pt; text-indent: -18pt;\"><span style=\"color: black; font-family: Symbol; font-size: 10pt;\">·</span><span 7pt;\"=\"\" font-size:=\"\" new=\"\" roman\",serif;=\"\" style=\"color: black; font-family: \" times=\"\">       </span><span 10pt;\"=\"\" font-size:=\"\" helvetica\",sans-serif;=\"\" style=\"color: black; font-family: \">Very strong executive presence with a demonstrated ability to navigate difficult situations through relationship building and influencing others</span></p><div>Not sure if you should apply for this role? Talk to your Manager or your HR Business Partner.</div><p> </p><div><strong>Posting Type:</strong> Internal and External Candidates Considered</div><div><strong>Hiring Manager:</strong> Michael Boulton</div><div><strong>Recruiter:</strong> Katherine Messina</div><div><strong>Salary Grade:</strong> 8</div><div><strong>Schedule:</strong> Full Time</div><div><strong>Shift:</strong> Day</div><div><strong>Length of Contract:</strong> Not Applicable (Regular Position)</div><div><strong>Work Location:</strong> 59 Ambassador Dr (096), Mississauga, ON </div><div><strong>Travel Requirements:</strong> Up to 50%</div><div><strong>Bargaining Unit/Union:</strong> NON - None</div><div><strong>Posting Category/Function:</strong> Technology &amp; Information Technology</div><div><strong>Referral Bonus Amount:</strong> $$0.00</div><div> </div><div>At Rogers, success is determined by the strength and diversity of our people. We work together because we want to win together, and these five shared values guide how we work:</div><div> </div><ol><li>Simplify and innovate</li><li>Take ownership of the what and the how</li><li>Equip people to succeed</li><li>Execute with discipline and pride</li><li>Talk straight, build trust, and over deliver</li></ol><div> </div><div>As you consider what’s next, remember that we work as one team, with one goal – to serve our customers better.</div><div> </div><div><p><em>We recognize the business value in creating a workplace where each team member has the tools to reach their full potential. At Rogers, we value the insights and innovation that diverse teams bring to work. We work with our candidates with disabilities throughout the recruitment process to ensure that they have what they need to be at their best. Please reach out to our recruiters and hiring managers to begin a conversation about how we can ensure that you deliver your best work. You can also reach out to our team at <a href=\"mailto:RogersRecruiting@rci.rogers.com\">RogersRecruiting@rci.rogers.com</a> to begin a conversation about your individual accessibility needs throughout the hiring process.</em></p></div></span><p class=\"job-location\"><span class=\"jobmarkets\"></span></p></div>"},
{"title": "Sales Associate - Londonderry Mall", "job_posted": "Aug 5, 2017", "job_location": "Edmonton, AB, CA, T5C 3C8", "province_name": "AB", "job_detail": "<div class=\"job\"><span itemprop=\"description\"><p>At Rogers we’re for supporting you on a journey to a rewarding career. Whether you’re a developer, an analyst, or a customer care consultant, Rogers is the place where ideas become reality. We embrace change, and find ways to do better. And we deliver on that commitment by fostering an environment of passion and innovation for all people.</p><p> </p><p><strong>Sales Associate</strong></p><p>Our Sales Associates make every customer feel welcome and leave delighted, more knowledgeable, and feeling better about Rogers and Fido every time. They know how to engage, show they care and invest the time with our customers to get things done. They want every customer sharing their experience and always coming back.</p><p>At Rogers, retail has impact, and so can you.</p><p><strong>In this role you will:</strong></p><ul><li>Deliver a superior and consistent customer experience</li><li>Be the first to learn about new products and services</li><li>Handle all issues and concerns – you're the one-stop resolution for our customers</li><li>Meet and exceed monthly sales targets</li><li>Work in a fast-paced environment that requires a high degree of multi-tasking</li><li>Work with and through others to achieve team goals in a highly collaborative environment</li><li>Be able to work a varied and flexible schedules <strong>(Monday – Sunday)</strong></li></ul><p><strong>You are someone who: </strong></p><ul><li>Knows how to greet and thank our customers – you want everyone to feel welcome and appreciated</li><li>Has a knack for building rapport – you genuinely care about our customers’ needs. It’s not just about the sale!</li><li>Ensures our customers understand our products and services </li><li>Enjoys solving customer problems – you take accountability for their issues</li><li>Is comfortable taking action, showing initiative and feels empowered to lead</li><li>Takes pride in their work environment and wants to see the team succeed</li><li>Acts as a brand ambassador, an educator, a leader, a problem solver, and so much more!</li></ul><p><strong>Benefits for you:</strong></p><ul><li>We invest in you, just as much as you invest in us</li><li>Base hourly rate and competitive commission structure</li><li>Opportunities to grow and develop your career</li><li>Strong internal development programs</li><li>Comprehensive health and dental plan for full time and part time employees</li><li>Outstanding share options and wealth accumulation programs</li><li>Employee discounts across Rogers &amp; Fido services</li><li>Overtime pay eligible</li></ul><p>As part of the recruitment process, candidates will be required to provide consent for and successfully pass a criminal background check.</p><div> </div><div><b>Schedule:</b> Part Time</div><div><b>Shift:</b> Variable</div><div><b>Length of Contract:</b> Not Applicable (Regular Position)</div><div><b>Work Location: </b>137 Ave,kiosk 5,Londonderry Mall (5509), Edmonton, AB </div><div><b>Travel Requirements:</b> None</div><div><b>Posting Category/Function: </b>Retail (In Store / Hourly) &amp; Sales and Service</div><div><b>Requisition ID:</b> 107293</div><div> </div><div><b>WHY ROGERS?</b></div><div> </div><div>As a proud Canadian company, we're dedicated to making things easier for our customers. We’ve been embracing and leading change for over 50-years, and we’ll continue to seek out new opportunities to bring our customers simple solutions for today and tomorrow.</div><div> </div><div>We recognize that success is determined by the strength and diversity of our people. We work together because we want to win together, and these five shared values guide and define our work:</div><div> </div><ol><li>Simplify and innovate</li><li>Take ownership of the what and the how</li><li>Equip people to succeed</li><li>Execute with discipline and pride</li><li>Talk straight, build trust, and over deliver</li></ol><div> </div><div>Why Rogers?  Because your tomorrow inspires our today.</div><div> </div><div>What makes us different makes us stronger. Rogers has a strong commitment to diversity and inclusion. Everyone who applies for a job will be considered.</div><div> </div><div><i>We recognize the business value in creating a workplace where each team member has the tools to reach their full potential. At Rogers, we value the insights and innovation that diverse teams bring to work. We work with our candidates with disabilities throughout the recruitment process to ensure that they have what they need to be at their best. Please reach out to our recruiters and hiring managers to begin a conversation about how we can ensure that you deliver your best work. You can also reach out to our team at <a href=\"mailto:RogersRecruiting@rci.rogers.com\">RogersRecruiting@rci.rogers.com</a></i> to begin a conversation about your individual accessibility needs throughout the hiring process.</div><div> </div><div>Posting Notes:  Retail || Canada (CA) || AB || Edmonton || Retail ||</div><p> </p></span><p class=\"job-location\"><span class=\"jobmarkets\"></span></p></div>"},
{"title": "Sales Associate - Polo Park", "job_posted": "Aug 5, 2017", "job_location": "Winnipeg, MB, CA, R3G 0W4", "province_name": "MB", "job_detail": "<div class=\"job\"><span itemprop=\"description\"><p>At Rogers we’re for supporting you on a journey to a rewarding career. Whether you’re a developer, an analyst, or a customer care consultant, Rogers is the place where ideas become reality. We embrace change, and find ways to do better. And we deliver on that commitment by fostering an environment of passion and innovation for all people.</p><p> </p><p><strong>Sales Associate</strong></p><p>Our Sales Associates make every customer feel welcome and leave delighted, more knowledgeable, and feeling better about Rogers and Fido every time. They know how to engage, show they care and invest the time with our customers to get things done. They want every customer sharing their experience and always coming back.</p><p>At Rogers, retail has impact, and so can you.</p><p><strong>In this role you will:</strong></p><ul><li>Deliver a superior and consistent customer experience</li><li>Be the first to learn about new products and services</li><li>Handle all issues and concerns – you're the one-stop resolution for our customers</li><li>Meet and exceed monthly sales targets</li><li>Work in a fast-paced environment that requires a high degree of multi-tasking</li><li>Work with and through others to achieve team goals in a highly collaborative environment</li><li>Be able to work a varied and flexible schedules <strong>(Monday – Sunday)</strong></li></ul><p><strong>You are someone who: </strong></p><ul><li>Knows how to greet and thank our customers – you want everyone to feel welcome and appreciated</li><li>Has a knack for building rapport – you genuinely care about our customers’ needs. It’s not just about the sale!</li><li>Ensures our customers understand our products and services </li><li>Enjoys solving customer problems – you take accountability for their issues</li><li>Is comfortable taking action, showing initiative and feels empowered to lead</li><li>Takes pride in their work environment and wants to see the team succeed</li><li>Acts as a brand ambassador, an educator, a leader, a problem solver, and so much more!</li></ul><p><strong>Benefits for you:</strong></p><ul><li>We invest in you, just as much as you invest in us</li><li>Base hourly rate and competitive commission structure</li><li>Opportunities to grow and develop your career</li><li>Strong internal development programs</li><li>Comprehensive health and dental plan for full time and part time employees</li><li>Outstanding share options and wealth accumulation programs</li><li>Employee discounts across Rogers &amp; Fido services</li><li>Overtime pay eligible</li></ul><p>As part of the recruitment process, candidates will be required to provide consent for and successfully pass a criminal background check.</p><div> </div><div><b>Schedule:</b> Part Time</div><div><b>Shift:</b> Flex Time</div><div><b>Length of Contract:</b> Not Applicable (Regular Position)</div><div><b>Work Location: </b>1485 Portage Ave, Unit # Z004 (5563), Winnipeg, MB </div><div><b>Travel Requirements:</b> Up to 10%</div><div><b>Posting Category/Function: </b>Retail (In Store / Hourly) &amp; Sales and Service</div><div><b>Requisition ID:</b> 107186</div><div> </div><div><b>WHY ROGERS?</b></div><div> </div><div>As a proud Canadian company, we're dedicated to making things easier for our customers. We’ve been embracing and leading change for over 50-years, and we’ll continue to seek out new opportunities to bring our customers simple solutions for today and tomorrow.</div><div> </div><div>We recognize that success is determined by the strength and diversity of our people. We work together because we want to win together, and these five shared values guide and define our work:</div><div> </div><ol><li>Simplify and innovate</li><li>Take ownership of the what and the how</li><li>Equip people to succeed</li><li>Execute with discipline and pride</li><li>Talk straight, build trust, and over deliver</li></ol><div> </div><div>Why Rogers?  Because your tomorrow inspires our today.</div><div> </div><div>What makes us different makes us stronger. Rogers has a strong commitment to diversity and inclusion. Everyone who applies for a job will be considered.</div><div> </div><div><i>We recognize the business value in creating a workplace where each team member has the tools to reach their full potential. At Rogers, we value the insights and innovation that diverse teams bring to work. We work with our candidates with disabilities throughout the recruitment process to ensure that they have what they need to be at their best. Please reach out to our recruiters and hiring managers to begin a conversation about how we can ensure that you deliver your best work. You can also reach out to our team at <a href=\"mailto:RogersRecruiting@rci.rogers.com\">RogersRecruiting@rci.rogers.com</a></i> to begin a conversation about your individual accessibility needs throughout the hiring process.</div><div> </div><div>Posting Notes:  Retail || Canada (CA) || MB || Winnipeg || Retail ||</div><p> </p></span><p class=\"job-location\"><span class=\"jobmarkets\"></span></p></div>"},
{"title": "Sales Associate - Kingsway Mall", "job_posted": "Aug 5, 2017", "job_location": "Edmonton, AB, CA, T5G 3A6", "province_name": "AB", "job_detail": "<div class=\"job\"><span itemprop=\"description\"><p>At Rogers we’re for supporting you on a journey to a rewarding career. Whether you’re a developer, an analyst, or a customer care consultant, Rogers is the place where ideas become reality. We embrace change, and find ways to do better. And we deliver on that commitment by fostering an environment of passion and innovation for all people.</p><p> </p><p><b>Sales Associate</b></p><p>Our Sales Associates make every customer feel welcome and leave delighted, more knowledgeable, and feeling better about Rogers and Fido every time. They know how to engage, show they care and invest the time with our customers to get things done. They want every customer sharing their experience and always coming back.</p><p>At Rogers, retail has impact, and so can you.</p><p><b>In this role you will:</b></p><ul><li>Deliver a superior and consistent customer experience</li><li>Be the first to learn about new products and services</li><li>Handle all issues and concerns – you're the one-stop resolution for our customers </li><li>Meet and exceed monthly sales targets </li><li>Work in a fast-paced environment that requires a high degree of multi-tasking</li><li>Work with and through others to achieve team goals in a highly collaborative environment </li><li>Be able to work a varied and flexible schedules <b>(Monday – Sunday)</b></li></ul><p><b>You are someone who: </b></p><ul><li>Knows how to greet and thank our customers – you want everyone to feel welcome and appreciated </li><li>Has a knack for building rapport – you genuinely care about our customers’ needs. It’s not just about the sale!</li><li>Ensures our customers understand our products and services  </li><li>Enjoys solving customer problems – you take accountability for their issues </li><li>Is comfortable taking action, showing initiative and feels empowered to lead</li><li>Takes pride in their work environment and wants to see the team succeed </li><li>Acts as a brand ambassador, an educator, a leader, a problem solver, and so much more!</li></ul><p><b>Benefits for you:</b></p><ul><li>We invest in you, just as much as you invest in us</li><li>Base hourly rate and competitive commission structure</li><li>Opportunities to grow and develop your career</li><li>Strong internal development programs</li><li>Comprehensive health and dental plan for full time and part time employees</li><li>Outstanding share options and wealth accumulation programs</li><li>Employee discounts across Rogers &amp; Fido services</li><li>Overtime pay eligible</li></ul><p>As part of the recruitment process, candidates will  be required to provide consent for and successfully pass a criminal background check.</p><div> </div><div><b>Schedule:</b> Part Time</div><div><b>Shift:</b> Flex Time</div><div><b>Length of Contract:</b> Not Applicable (Regular Position)</div><div><b>Work Location: </b>109 St&amp; Princess Elizabeth, K540 (7324), Edmonton, AB </div><div><b>Travel Requirements:</b> Up to 10%</div><div><b>Posting Category/Function: </b>Retail (In Store / Hourly) &amp; Sales and Service</div><div><b>Requisition ID:</b> 106885</div><div> </div><div><b>WHY ROGERS?</b></div><div> </div><div>As a proud Canadian company, we're dedicated to making things easier for our customers. We’ve been embracing and leading change for over 50-years, and we’ll continue to seek out new opportunities to bring our customers simple solutions for today and tomorrow.</div><div> </div><div>We recognize that success is determined by the strength and diversity of our people. We work together because we want to win together, and these five shared values guide and define our work:</div><div> </div><ol><li>Simplify and innovate</li><li>Take ownership of the what and the how</li><li>Equip people to succeed</li><li>Execute with discipline and pride</li><li>Talk straight, build trust, and over deliver</li></ol><div> </div><div>Why Rogers?  Because your tomorrow inspires our today.</div><div> </div><div>What makes us different makes us stronger. Rogers has a strong commitment to diversity and inclusion. Everyone who applies for a job will be considered.</div><div> </div><div><i>We recognize the business value in creating a workplace where each team member has the tools to reach their full potential. At Rogers, we value the insights and innovation that diverse teams bring to work. We work with our candidates with disabilities throughout the recruitment process to ensure that they have what they need to be at their best. Please reach out to our recruiters and hiring managers to begin a conversation about how we can ensure that you deliver your best work. You can also reach out to our team at <a href=\"mailto:RogersRecruiting@rci.rogers.com\">RogersRecruiting@rci.rogers.com</a></i> to begin a conversation about your individual accessibility needs throughout the hiring process.</div><div> </div><div>Posting Notes:  Retail || Canada (CA) || AB || Edmonton || Retail ||</div><p> </p></span><p class=\"job-location\"><span class=\"jobmarkets\"></span></p></div>"},
{"title": "Sales Associate - Fido West Edmonton Mall 2", "job_posted": "Aug 5, 2017", "job_location": "Edmonton, AB, CA, T5T 4M2", "province_name": "AB", "job_detail": "<div class=\"job\"><span itemprop=\"description\"><p>At Rogers we’re for supporting you on a journey to a rewarding career. Whether you’re a developer, an analyst, or a customer care consultant, Rogers is the place where ideas become reality. We embrace change, and find ways to do better. And we deliver on that commitment by fostering an environment of passion and innovation for all people.</p><p> </p><p><strong>Sales Associate</strong></p><p>Our Sales Associates make every customer feel welcome and leave delighted, more knowledgeable, and feeling better about Rogers and Fido every time. They know how to engage, show they care and invest the time with our customers to get things done. They want every customer sharing their experience and always coming back.</p><p>At Rogers, retail has impact, and so can you.</p><p><strong>In this role you will:</strong></p><ul><li>Deliver a superior and consistent customer experience</li><li>Be the first to learn about new products and services</li><li>Handle all issues and concerns – you're the one-stop resolution for our customers</li><li>Meet and exceed monthly sales targets</li><li>Work in a fast-paced environment that requires a high degree of multi-tasking</li><li>Work with and through others to achieve team goals in a highly collaborative environment</li><li>Be able to work a varied and flexible schedules <strong>(Monday – Sunday)</strong></li></ul><p><strong>You are someone who: </strong></p><ul><li>Knows how to greet and thank our customers – you want everyone to feel welcome and appreciated</li><li>Has a knack for building rapport – you genuinely care about our customers’ needs. It’s not just about the sale!</li><li>Ensures our customers understand our products and services </li><li>Enjoys solving customer problems – you take accountability for their issues</li><li>Is comfortable taking action, showing initiative and feels empowered to lead</li><li>Takes pride in their work environment and wants to see the team succeed</li><li>Acts as a brand ambassador, an educator, a leader, a problem solver, and so much more!</li></ul><p><strong>Benefits for you:</strong></p><ul><li>We invest in you, just as much as you invest in us</li><li>Base hourly rate and competitive commission structure</li><li>Opportunities to grow and develop your career</li><li>Strong internal development programs</li><li>Comprehensive health and dental plan for full time and part time employees</li><li>Outstanding share options and wealth accumulation programs</li><li>Employee discounts across Rogers &amp; Fido services</li><li>Overtime pay eligible</li></ul><p>As part of the recruitment process, candidates will be required to provide consent for and successfully pass a criminal background check.</p><div> </div><div><b>Schedule:</b> Part Time</div><div><b>Shift:</b> Variable</div><div><b>Length of Contract:</b> Not Applicable (Regular Position)</div><div><b>Work Location: </b>8882 170th St., Unit K-031 (5522), Edmonton, AB </div><div><b>Travel Requirements:</b> Up to 25%</div><div><b>Posting Category/Function: </b>Retail (In Store / Hourly) &amp; Sales and Service</div><div><b>Requisition ID:</b> 107105</div><div> </div><div><b>WHY ROGERS?</b></div><div> </div><div>As a proud Canadian company, we're dedicated to making things easier for our customers. We’ve been embracing and leading change for over 50-years, and we’ll continue to seek out new opportunities to bring our customers simple solutions for today and tomorrow.</div><div> </div><div>We recognize that success is determined by the strength and diversity of our people. We work together because we want to win together, and these five shared values guide and define our work:</div><div> </div><ol><li>Simplify and innovate</li><li>Take ownership of the what and the how</li><li>Equip people to succeed</li><li>Execute with discipline and pride</li><li>Talk straight, build trust, and over deliver</li></ol><div> </div><div>Why Rogers?  Because your tomorrow inspires our today.</div><div> </div><div>What makes us different makes us stronger. Rogers has a strong commitment to diversity and inclusion. Everyone who applies for a job will be considered.</div><div> </div><div><i>We recognize the business value in creating a workplace where each team member has the tools to reach their full potential. At Rogers, we value the insights and innovation that diverse teams bring to work. We work with our candidates with disabilities throughout the recruitment process to ensure that they have what they need to be at their best. Please reach out to our recruiters and hiring managers to begin a conversation about how we can ensure that you deliver your best work. You can also reach out to our team at <a href=\"mailto:RogersRecruiting@rci.rogers.com\">RogersRecruiting@rci.rogers.com</a></i> to begin a conversation about your individual accessibility needs throughout the hiring process.</div><div> </div><div>Posting Notes:  Retail || Canada (CA) || AB || Edmonton || Retail ||</div><p> </p></span><p class=\"job-location\"><span class=\"jobmarkets\"></span></p></div>"},
{"title": "Sales Associate - Southgate Centre", "job_posted": "Aug 5, 2017", "job_location": "Edmonton, AB, CA, T6H 4M6", "province_name": "AB", "job_detail": "<div class=\"job\"><span itemprop=\"description\"><p>At Rogers we’re for supporting you on a journey to a rewarding career. Whether you’re a developer, an analyst, or a customer care consultant, Rogers is the place where ideas become reality. We embrace change, and find ways to do better. And we deliver on that commitment by fostering an environment of passion and innovation for all people.</p><p> </p><p><b>Sales Associate</b></p><p>Our Sales Associates make every customer feel welcome and leave delighted, more knowledgeable, and feeling better about Rogers and Fido every time. They know how to engage, show they care and invest the time with our customers to get things done. They want every customer sharing their experience and always coming back.</p><p>At Rogers, retail has impact, and so can you.</p><p><b>In this role you will:</b></p><ul><li>Deliver a superior and consistent customer experience</li><li>Be the first to learn about new products and services</li><li>Handle all issues and concerns – you're the one-stop resolution for our customers </li><li>Meet and exceed monthly sales targets </li><li>Work in a fast-paced environment that requires a high degree of multi-tasking</li><li>Work with and through others to achieve team goals in a highly collaborative environment </li><li>Be able to work a varied and flexible schedules <b>(Monday – Sunday)</b></li></ul><p><b>You are someone who: </b></p><ul><li>Knows how to greet and thank our customers – you want everyone to feel welcome and appreciated </li><li>Has a knack for building rapport – you genuinely care about our customers’ needs. It’s not just about the sale!</li><li>Ensures our customers understand our products and services  </li><li>Enjoys solving customer problems – you take accountability for their issues </li><li>Is comfortable taking action, showing initiative and feels empowered to lead</li><li>Takes pride in their work environment and wants to see the team succeed </li><li>Acts as a brand ambassador, an educator, a leader, a problem solver, and so much more!</li></ul><p><b>Benefits for you:</b></p><ul><li>We invest in you, just as much as you invest in us</li><li>Base hourly rate and competitive commission structure</li><li>Opportunities to grow and develop your career</li><li>Strong internal development programs</li><li>Comprehensive health and dental plan for full time and part time employees</li><li>Outstanding share options and wealth accumulation programs</li><li>Employee discounts across Rogers &amp; Fido services</li><li>Overtime pay eligible</li></ul><p>As part of the recruitment process, candidates will  be required to provide consent for and successfully pass a criminal background check.</p><div> </div><div><b>Schedule:</b> Part Time</div><div><b>Shift:</b> Flex Time</div><div><b>Length of Contract:</b> Not Applicable (Regular Position)</div><div><b>Work Location: </b>5015 111 ST NW, Unit 318 (5675), Edmonton, AB </div><div><b>Travel Requirements:</b> None</div><div><b>Posting Category/Function: </b>Retail (In Store / Hourly) &amp; Sales and Service</div><div><b>Requisition ID:</b> 106906</div><div> </div><div><b>WHY ROGERS?</b></div><div> </div><div>As a proud Canadian company, we're dedicated to making things easier for our customers. We’ve been embracing and leading change for over 50-years, and we’ll continue to seek out new opportunities to bring our customers simple solutions for today and tomorrow.</div><div> </div><div>We recognize that success is determined by the strength and diversity of our people. We work together because we want to win together, and these five shared values guide and define our work:</div><div> </div><ol><li>Simplify and innovate</li><li>Take ownership of the what and the how</li><li>Equip people to succeed</li><li>Execute with discipline and pride</li><li>Talk straight, build trust, and over deliver</li></ol><div> </div><div>Why Rogers?  Because your tomorrow inspires our today.</div><div> </div><div>What makes us different makes us stronger. Rogers has a strong commitment to diversity and inclusion. Everyone who applies for a job will be considered.</div><div> </div><div><i>We recognize the business value in creating a workplace where each team member has the tools to reach their full potential. At Rogers, we value the insights and innovation that diverse teams bring to work. We work with our candidates with disabilities throughout the recruitment process to ensure that they have what they need to be at their best. Please reach out to our recruiters and hiring managers to begin a conversation about how we can ensure that you deliver your best work. You can also reach out to our team at <a href=\"mailto:RogersRecruiting@rci.rogers.com\">RogersRecruiting@rci.rogers.com</a></i> to begin a conversation about your individual accessibility needs throughout the hiring process.</div><div> </div><div>Posting Notes:  Retail || Canada (CA) || AB || Edmonton || Retail ||</div><p> </p></span><p class=\"job-location\"><span class=\"jobmarkets\"></span></p></div>"},
{"title": "Sales Associate - Guildford Town Centre Fido", "job_posted": "Aug 5, 2017", "job_location": "Surrey, BC, CA, V3R 7C1", "province_name": "BC", "job_detail": "<div class=\"job\"><span itemprop=\"description\"><p>At Rogers we’re for supporting you on a journey to a rewarding career. Whether you’re a developer, an analyst, or a customer care consultant, Rogers is the place where ideas become reality. We embrace change, and find ways to do better. And we deliver on that commitment by fostering an environment of passion and innovation for all people.</p><p> </p><div>Our Sales Associates don’t just embrace the latest technology and content – it’s part of who they are. We want people on our team who are excited about our products and services and want to share their knowledge and experience with others. At<span> </span> Fido retail has impact, and so can you.</div><p>We’re looking for outgoing, approachable sales associates with a proven track record in sales to join our<span> </span>Fido Guildford Town Centre store on a part time<i style=\"font-size:1.0em\"><b style=\"font-weight:700.0\"><span> </span></b></i>basis. You’ll build and establish customer relationships, own the resolution of customer issues, and act as a Fido ambassador</p><p><b style=\"font-weight:700.0\">Your Experience</b></p><ul><li style=\"color:#414042;line-height:1.25em;font-size:1.0em\">Proven success in a sales role, ideally within telecommunications, technology or retail</li><li style=\"color:#414042;line-height:1.25em;font-size:1.0em\">A sales professional with an ability to achieve individual sales targets</li><li style=\"color:#414042;line-height:1.25em;font-size:1.0em\">A passion for delivering exceptional customer service and sales experience</li><li style=\"color:#414042;line-height:1.25em;font-size:1.0em\">Tech savvy and eager to learn about technology and the telecom industry</li><li style=\"color:#414042;line-height:1.25em;font-size:1.0em\">An ability to think outside of the box and work in a fast-paced retail sales role</li><li style=\"color:#414042;line-height:1.25em;font-size:1.0em\">A proactive team player</li><li style=\"color:#414042;line-height:1.25em;font-size:1.0em\">Additional languages<span> </span><span>(Mandarin and Cantonese) </span>are an asset</li><li style=\"color:#414042;line-height:1.25em;font-size:1.0em\">An ability to work a varied and flexible schedule<span> </span><i style=\"font-size:1.0em\">(20-30 hours per week, Monday – Sunday)</i></li></ul><p><b style=\"font-weight:700.0\">Benefits for You</b></p><ul><li style=\"color:#414042;line-height:1.25em;font-size:1.0em\">Base hourly rate and competitive commission structure</li><li style=\"color:#414042;line-height:1.25em;font-size:1.0em\">Flexible schedule</li><li style=\"color:#414042;line-height:1.25em;font-size:1.0em\">Comprehensive health and dental plan for full time and part time employees</li><li style=\"color:#414042;line-height:1.25em;font-size:1.0em\">Outstanding share options and wealth accumulation programs</li><li style=\"color:#414042;line-height:1.25em;font-size:1.0em\">Employee discounts across Rogers &amp; Fido services</li><li style=\"color:#414042;line-height:1.25em;font-size:1.0em\">A company committed to investing in and developing our own talent</li><li style=\"color:#414042;line-height:1.25em;font-size:1.0em\">Employee recognition programs</li><li style=\"color:#414042;line-height:1.25em;font-size:1.0em\">Overtime pay eligible</li></ul><p><b style=\"font-weight:700.0\">As part of the recruitment process, candidates will be required to provide consent for and successfully pass a criminal background check.</b></p><div> </div><div><b>Schedule:</b> Part Time</div><div><b>Shift:</b> Variable</div><div><b>Length of Contract:</b> Not Applicable (Regular Position)</div><div><b>Work Location: </b>2695 Guildford Town Center (5715), Surrey, BC </div><div><b>Travel Requirements:</b> None</div><div><b>Posting Category/Function: </b>Retail (In Store / Hourly) &amp; Sales and Service</div><div><b>Requisition ID:</b> 104500</div><div> </div><div><b>WHY ROGERS?</b></div><div> </div><div>As a proud Canadian company, we're dedicated to making things easier for our customers. We’ve been embracing and leading change for over 50-years, and we’ll continue to seek out new opportunities to bring our customers simple solutions for today and tomorrow.</div><div> </div><div>We recognize that success is determined by the strength and diversity of our people. We work together because we want to win together, and these five shared values guide and define our work:</div><div> </div><ol><li>Simplify and innovate</li><li>Take ownership of the what and the how</li><li>Equip people to succeed</li><li>Execute with discipline and pride</li><li>Talk straight, build trust, and over deliver</li></ol><div> </div><div>Why Rogers?  Because your tomorrow inspires our today.</div><div> </div><div>What makes us different makes us stronger. Rogers has a strong commitment to diversity and inclusion. Everyone who applies for a job will be considered.</div><div> </div><div><i>We recognize the business value in creating a workplace where each team member has the tools to reach their full potential. At Rogers, we value the insights and innovation that diverse teams bring to work. We work with our candidates with disabilities throughout the recruitment process to ensure that they have what they need to be at their best. Please reach out to our recruiters and hiring managers to begin a conversation about how we can ensure that you deliver your best work. You can also reach out to our team at <a href=\"mailto:RogersRecruiting@rci.rogers.com\">RogersRecruiting@rci.rogers.com</a></i> to begin a conversation about your individual accessibility needs throughout the hiring process.</div><div> </div><div>Posting Notes:  Retail || Canada (CA) || BC || Surrey || Retail ||</div><p> </p></span><p class=\"job-location\"><span class=\"jobmarkets\"></span></p></div>"},
{"title": "DevOps Cloud Specialist", "job_posted": "Aug 5, 2017", "job_location": "Toronto, ON, CA, M4W 1A9", "province_name": "ON", "job_detail": "<div class=\"job\"><span itemprop=\"description\"><div>Every day, we strive to build a brilliant digital future for Canadians. We work as one team, with one goal –serve our customers better.</div><div> </div><p>Rogers has an exciting opportunity if you are passionate about technology.  Be a part of a dynamic team responsible for driving forward our portfolio of brands while championing DevOps across the organization.  Aside from your technical skills, you’re a leader that’s passionate about DevOps and enjoy coaching others and spreading the culture.  As a Senior Cloud Operations Engineer, you will mentor other team members and collaborate with cross-functional teams across IT to plan for and maintain a cost effective, high performing, highly available and scalable cloud infrastructure.  This is a unique opportunity to work with leading-edge technologies in a fast-paced environment within a large organization.</p><p> </p><p>RESPONSIBILITIES:</p><p> </p><ul><li>24/7/365 rotational on-call production support to ensure delivery of first-class service and support to customers.</li><li>Provide mentorship, guidance and leadership to the team and other team members.</li><li>System and application management in production and non-production environments.</li><li>Full stack monitoring, alerting and troubleshooting including network, storage, OS, compute, services &amp; applications.</li><li>Monitor patches from vendors and apply pro-actively within the assigned environment</li><li>Incident management including root cause analysis and remediation.</li><li>Security and compliance management with centralized logging, threat analysis and remediation.</li><li>Proactive system analysis, tuning and optimization.</li></ul><p> </p><p> </p><p>QUALIFICATIONS:</p><p> </p><ul><li>Passion for emerging technologies and love keeping up with the latest technology trends.</li><li>Customer centric, and realize the value of providing excellent customer service.</li><li>Proven leadership skills and the ability to motivate teams. Exceptional abilities at mentoring and engaging others, empowering teams and inspiring them to excellence</li><li>Strong written and oral communications skills and the ability to communicate with all levels of users/management</li><li>Strong organization skills, interpersonal skills and excellent attention to details</li><li>Ability to understand and apply new technologies with a strong desire to learn and improve</li><li>Ability to effectively prioritize, make decisions, solve problems and execute tasks in a high-pressure environment</li><li>Ability to work independently and within a team on multiple simultaneous tasks within a challenging fast paced customer-oriented environment.</li><li>Thorough understanding of Internet architectures;</li><li>5+ years’ System Administration experience in a large-scale, multi-OS (Linux/Windows), high-availability environments</li><li>3+ years’ experience with Microsoft services and configuration: IIS, Active Directory &amp; SQL Server</li><li>3+ years’ experience working with Oracle WebLogic and Database</li><li>3+ years’ experience with cloud computing in AWS or Azure</li><li>1+ years’ experience with big data technologies: Spark, Kafka, Cassandra, Play / Akka, Oracle Golden Gate</li><li>Experience setting up and regularly using monitoring, trending and logging tools (HP Operations Management, Oracle Enterprise Manager, Dynatrace, DataDog, Azure Diagnostics, AWS CloudWatch)</li><li>Experience with revision control systems and usage for managing systems configuration: Git, SVN etc.</li><li>Experience with managing, operating and monitoring backup systems</li><li>Familiarity with fundamental networking/distributed computing environment concepts; can configure SMB/NFS, key-based auth; DNS; familiar with basic networking concepts: switching, routing, OSI network layers, firewalls, load-balancing at various layers, SMTP, HTTP, SSL, SSH, AD, LDAP, VPN</li><li>Understanding of programming and scripting languages (Bash, Python, Java, Ruby)</li><li>Understanding of containerization &amp; orchestration: Docker, CoreOS, Kubernetes, auto-scaling and self-healing systems.</li></ul><div><strong>Shift:</strong> Day</div><div><strong>Length of Contract:</strong> Not Applicable (Regular Position)</div><div><strong>Work Location: </strong>350 Bloor Street East (299), Toronto, ON </div><div><strong>Travel Requirements:</strong> Up to 10%</div><div><strong>Posting Category/Function: </strong>Technology &amp; Information Technology</div><div><strong>Requisition ID:</strong> 101296</div><div> </div><div><b>WHY ROGERS?</b></div><div> </div><div>As a proud Canadian company, we're dedicated to making things easier for our customers. We’ve been embracing and leading change for over 50-years, and we’ll continue to seek out new opportunities to bring our customers simple solutions for today and tomorrow.</div><div> </div><div>At Rogers, we recognize that success is determined by the strength and diversity of our people. We work together because we want to win together, and these five shared values guide and define our work:</div><div> </div><ol><li>Simplify and innovate</li><li>Take ownership of the what and the how</li><li>Equip people to succeed</li><li>Execute with discipline and pride</li><li>Talk straight, build trust, and over deliver</li></ol><div> </div><div>Why Rogers? Because we believe the best is yet to come.</div><div> </div><div><em>We recognize the business value in creating a workplace where each team member has the tools to reach their full potential. At Rogers, we value the insights and innovation that diverse teams bring to work. We work with our candidates with disabilities throughout the recruitment process to ensure that they have what they need to be at their best. Please reach out to our recruiters and hiring managers to begin a conversation about how we can ensure that you deliver your best work. You can also reach out to our team at <a href=\"mailto:RogersRecruiting@rci.rogers.com\">RogersRecruiting@rci.rogers.com</a> to begin a conversation about your individual accessibility needs throughout the hiring process.</em></div><div> </div><div>Posting Notes:  Information Technology &amp; Engineering || Canada (CA) || ON || Toronto || SF:LI-LW1 ||</div><p> </p></span><p class=\"job-location\"><span class=\"jobmarkets\"></span></p></div>"},
{"title": "Android Developer", "job_posted": "Aug 5, 2017", "job_location": "Toronto, ON, CA, M4Y 2Y5", "province_name": "ON", "job_detail": "<div class=\"job\"><span itemprop=\"description\"><div>Every day, we strive to build a brilliant digital future for Canadians. We work as one team, with one goal –serve our customers better.</div><div> </div><p><strong>Who we are</strong></p><p> </p><p>We are Rogers, a dynamic Canadian media and telecommunications company. Innovation is our legacy and building a brilliant digital future is our mission. As a leading Canadian company we are passionate about winning and committed to pursuing the best. This translates into everything we do, including the selection of a candidate.</p><p>Mobile Developers at Rogers are passionate about native mobile app development and have a proven track record. They have experience developing for Android and know the ins and outs of Google’s version of Java, the associated APIs.</p><p> </p><p><strong>What we want you to do</strong></p><p> </p><p>We are looking for a Mobile Android Developer who will be a critical member of a new, forward-thinking, Digital IT team. You will develop native mobile apps on Android that will respond quickly to user actions, have low power requirements and include functions that enable flawless, customer friendly user experience. You will creatively produce interfaces that are not constrained by small form factors and work well on larger tablets. This role is based out of our downtown office but may expand to Brampton as well.</p><p> </p><p><strong>The nuts and bolts</strong></p><p> </p><ul><li>Prior development experience in Java for web applications</li><li>Create native applications for Android from cradle to grave</li><li>Work with developers and architects to create services that can be called without incurring excessive data use</li><li>Initial unit testing of features in native mobile apps after they are developed</li><li>Work closely with UX and UI designers to help them understand the constraints of native mobile applications so that they produce usable designs</li><li>Agile development experience\r\t<p> </p><p><strong>Who you are</strong></p><p> </p></li></ul><ul><li>A university graduate with a degree in engineering or computer science</li><li>You have 3-5 years of experience in building native mobile apps</li><li>Knowledge of Android Java and the APIs associated with each of these</li><li>You’ve demonstrated your ability to create native mobile applications\r\t<p> </p></li></ul><div><strong>Shift:</strong> Day</div><div><strong>Length of Contract:</strong> Not Applicable (Regular Position)</div><div><strong>Work Location: </strong>1 Mount Pleasant (083), Toronto, ON </div><div><strong>Travel Requirements:</strong> Up to 10%</div><div><strong>Posting Category/Function: </strong>Technology &amp; Information Technology</div><div><strong>Requisition ID:</strong> 101293</div><div> </div><div><b>WHY ROGERS?</b></div><div> </div><div>As a proud Canadian company, we're dedicated to making things easier for our customers. We’ve been embracing and leading change for over 50-years, and we’ll continue to seek out new opportunities to bring our customers simple solutions for today and tomorrow.</div><div> </div><div>At Rogers, we recognize that success is determined by the strength and diversity of our people. We work together because we want to win together, and these five shared values guide and define our work:</div><div> </div><ol><li>Simplify and innovate</li><li>Take ownership of the what and the how</li><li>Equip people to succeed</li><li>Execute with discipline and pride</li><li>Talk straight, build trust, and over deliver</li></ol><div> </div><div>Why Rogers? Because we believe the best is yet to come.</div><div> </div><div><em>We recognize the business value in creating a workplace where each team member has the tools to reach their full potential. At Rogers, we value the insights and innovation that diverse teams bring to work. We work with our candidates with disabilities throughout the recruitment process to ensure that they have what they need to be at their best. Please reach out to our recruiters and hiring managers to begin a conversation about how we can ensure that you deliver your best work. You can also reach out to our team at <a href=\"mailto:RogersRecruiting@rci.rogers.com\">RogersRecruiting@rci.rogers.com</a> to begin a conversation about your individual accessibility needs throughout the hiring process.</em></div><div> </div><div>Posting Notes:  Information Technology &amp; Engineering || Canada (CA) || ON || Toronto || SF:LI-LW1 ||</div><p> </p></span><p class=\"job-location\"><span class=\"jobmarkets\"></span></p></div>"},
{"title": "Sales Associate - Rogers Conestoga Mall", "job_posted": "Aug 5, 2017", "job_location": "Waterloo, ON, CA, N2L 5W6", "province_name": "ON", "job_detail": "<div class=\"job\"><span itemprop=\"description\"><p>At Rogers we’re for supporting you on a journey to a rewarding career. Whether you’re a developer, an analyst, or a customer care consultant, Rogers is the place where ideas become reality. We embrace change, and find ways to do better. And we deliver on that commitment by fostering an environment of passion and innovation for all people.</p><p> </p><p>Our Sales Associates don’t just embrace the latest technology and content – it’s part of who they are. We want people on our team who are excited about our products and services and want to share their knowledge and experience with others. At Rogers, retail has impact, and so can you.</p><p>We’re looking for outgoing, approachable sales associates with a proven track record in sales to join our Conestoga Mall store on a part time basis. You’ll build and establish customer relationships, own the resolution of customer issues, and act as a Rogers ambassador.</p><p><b>Your Experience</b></p><ul><li>Proven success in a sales role, ideally within telecommunications, technology or retail</li><li>A sales professional with an ability to achieve individual sales targets</li><li>A passion for delivering exceptional customer service and sales experience</li><li>Tech savvy and eager to learn about technology and the telecom industry</li><li>An ability to think outside of the box and work in a fast-paced retail sales role</li><li>A proactive team player</li><li>Additional languages  are an asset</li><li>An ability to work a varied and flexible schedule <i>(20-30 hours per week, Monday – Sunday)</i></li></ul><p><b>Benefits for You</b></p><ul><li>Base hourly rate and competitive commission structure</li><li>Flexible schedule</li><li>Comprehensive health and dental plan for full time and part time employees</li><li>Outstanding share options and wealth accumulation programs</li><li>Employee discounts across Rogers &amp; Fido services</li><li>A company committed to investing in and developing our own talent</li><li>Employee recognition programs</li><li>Overtime pay eligible</li></ul><p> </p><p><b>As part of the recruitment process, candidates will be required to provide consent for and successfully pass a criminal background check.</b></p><div> </div><div><b>Schedule:</b> Part Time</div><div><b>Shift:</b> Variable</div><div><b>Length of Contract:</b> Not Applicable (Regular Position)</div><div><b>Work Location: </b>550 King St N Unit 5G (5419), Waterloo, ON </div><div><b>Travel Requirements:</b> None</div><div><b>Posting Category/Function: </b>Retail (In Store / Hourly) &amp; Sales and Service</div><div><b>Requisition ID:</b> 104767</div><div> </div><div><b>WHY ROGERS?</b></div><div> </div><div>As a proud Canadian company, we're dedicated to making things easier for our customers. We’ve been embracing and leading change for over 50-years, and we’ll continue to seek out new opportunities to bring our customers simple solutions for today and tomorrow.</div><div> </div><div>We recognize that success is determined by the strength and diversity of our people. We work together because we want to win together, and these five shared values guide and define our work:</div><div> </div><ol><li>Simplify and innovate</li><li>Take ownership of the what and the how</li><li>Equip people to succeed</li><li>Execute with discipline and pride</li><li>Talk straight, build trust, and over deliver</li></ol><div> </div><div>Why Rogers?  Because your tomorrow inspires our today.</div><div> </div><div>What makes us different makes us stronger. Rogers has a strong commitment to diversity and inclusion. Everyone who applies for a job will be considered.</div><div> </div><div><i>We recognize the business value in creating a workplace where each team member has the tools to reach their full potential. At Rogers, we value the insights and innovation that diverse teams bring to work. We work with our candidates with disabilities throughout the recruitment process to ensure that they have what they need to be at their best. Please reach out to our recruiters and hiring managers to begin a conversation about how we can ensure that you deliver your best work. You can also reach out to our team at <a href=\"mailto:RogersRecruiting@rci.rogers.com\">RogersRecruiting@rci.rogers.com</a></i> to begin a conversation about your individual accessibility needs throughout the hiring process.</div><div> </div><div>Posting Notes:  Retail || Canada (CA) || ON || Waterloo || Retail ||</div><p> </p></span><p class=\"job-location\"><span class=\"jobmarkets\"></span></p></div>"},
{"title": "Director, Credit Risk and Collection", "job_posted": "Aug 5, 2017", "job_location": "Toronto, ON, CA, M4Y 2Y5", "province_name": "ON", "job_detail": "<div class=\"job\"><span itemprop=\"description\"><div>Every day, we strive to build a brilliant digital future for Canadians. We work as one team, with one goal –serve our customers better.</div><div> </div><p><strong>Director, Credit Risk and Collections</strong></p><p> </p><p>Credit Operations is looking for a dynamic, influential and results driven leader as Director of Credit Risk and Collection reporting directly to the Vice President, Credit Operations.  This is an excellent opportunity for promotion ready individuals or those seeking a lateral move to broaden experience and demonstrate leadership agility. The successful candidate will lead a large highly engaged team responsible for developing and managing credit risk and collection policies and strategies, involuntary churn and retention tactics and performance management across the Credit Operations organization.  The Director will work in partnership with peers across the EBU, CBU, MBU, Finance and the Customer Experience teams to achieve financial, subscriber and customer experience results.</p><p> </p><p><strong>What You Will Be Doing</strong></p><p> </p><p>• Define and deliver CBU and EBU credit risk strategies that achieve subscriber growth and improve financial results</p><p>• Actively engage / collaborate with leaders across the business to establish effective policies</p><p>• Drive credit system(s) and process improvements across all channels</p><p>• Secure executive alignment and approvals (including capital requests) as needed</p><p>• Establish Credit Risk and Collection operating plans and 3 -5 year strategic roadmap</p><p>• Continually review and enhance credit risk and collection models and decision trees to improve results</p><p>• Drive continuous improvement through regular iterative policy changes (champion challenger)</p><p>• Develop and manage effective and efficient collection timelines by utilizing voice, SMS and eMail strategies that maximize payment resolution rates</p><p>• Work with CBU, EBU and finance teams to establish involuntary churn targets, track performance and take action where necessary to deliver results</p><p>• Work closely with the operations to establish and execute involuntary churn retention strategies</p><p>•Track and monitor key credit risk and collection performance against plan, and present results to senior management with action plans for improvement</p><p>• Build a high performance team by driving team empowerment, engagement and collaboration through focused coaching and development</p><p> </p><p><strong>What You Bring</strong></p><p> </p><p>• Post-secondary degree in Math, Economics, Business or related discipline </p><p>• Minimum 3 years at the Director level is preferred</p><p>• Minimum 5-7 years of progressive cross functional experience leading large teams</p><p>• Demonstrated track record delivering results while managing complex competing demands</p><p>• Strong communicator with an ability to influence key stakeholders at all levels in the organization</p><p>• Strong collaborator and relationship builder living the Rogers values</p><p>• Strong business sense and acumen for financial results</p><p>• Strategic thinker who is keen on driving continuous improvement</p><p>• Ability to drive and manage change</p><p> </p><div><strong>Shift:</strong> Day</div><div><strong>Length of Contract:</strong> Not Applicable (Regular Position)</div><div><strong>Work Location: </strong>1 Mount Pleasant (083), Toronto, ON </div><div><strong>Travel Requirements:</strong> Up to 10%</div><div><strong>Posting Category/Function: </strong>Call Centre Operations &amp; Credit Operations</div><div><strong>Requisition ID:</strong> 101016</div><div> </div><div><b>WHY ROGERS?</b></div><div> </div><div>As a proud Canadian company, we're dedicated to making things easier for our customers. We’ve been embracing and leading change for over 50-years, and we’ll continue to seek out new opportunities to bring our customers simple solutions for today and tomorrow.</div><div> </div><div>At Rogers, we recognize that success is determined by the strength and diversity of our people. We work together because we want to win together, and these five shared values guide and define our work:</div><div> </div><ol><li>Simplify and innovate</li><li>Take ownership of the what and the how</li><li>Equip people to succeed</li><li>Execute with discipline and pride</li><li>Talk straight, build trust, and over deliver</li></ol><div> </div><div>Why Rogers? Because we believe the best is yet to come.</div><div> </div><div><em>We recognize the business value in creating a workplace where each team member has the tools to reach their full potential. At Rogers, we value the insights and innovation that diverse teams bring to work. We work with our candidates with disabilities throughout the recruitment process to ensure that they have what they need to be at their best. Please reach out to our recruiters and hiring managers to begin a conversation about how we can ensure that you deliver your best work. You can also reach out to our team at <a href=\"mailto:RogersRecruiting@rci.rogers.com\">RogersRecruiting@rci.rogers.com</a> to begin a conversation about your individual accessibility needs throughout the hiring process.</em></div><div> </div><div>Posting Notes:  Corporate || Canada (CA) || ON || Toronto || None ||</div><p> </p></span><p class=\"job-location\"><span class=\"jobmarkets\"></span></p></div>"},
{"title": "Sr Cloud Specialist", "job_posted": "Aug 5, 2017", "job_location": "Brampton, ON, CA, L6T 0C1", "province_name": "ON", "job_detail": "<div class=\"job\"><span itemprop=\"description\"><div>Every day, we strive to build a brilliant digital future for Canadians. We work as one team, with one goal –serve our customers better.</div><div> </div><p>Rogers has an exciting opportunity if you are passionate about technology.  Be a part of a dynamic team responsible for driving forward our portfolio of brands while championing DevOps across the organization.  Aside from your technical skills, you’re a leader that’s passionate about DevOps and enjoy coaching others and spreading the culture.  As a Senior Cloud Operations Engineer, you will mentor other team members and collaborate with cross-functional teams across IT to plan for and maintain a cost effective, high performing, highly available and scalable cloud infrastructure.  This is a unique opportunity to work with leading-edge technologies in a fast-paced environment within a large organization.</p><p> </p><p>RESPONSIBILITIES:</p><p> </p><ul><li>24/7/365 rotational on-call production support to ensure delivery of first-class service and support to customers.</li><li>Provide mentorship, guidance and leadership to the team and other team members.</li><li>System and application management in production and non-production environments.</li><li>Full stack monitoring, alerting and troubleshooting including network, storage, OS, compute, services &amp; applications.</li><li>Monitor patches from vendors and apply pro-actively within the assigned environment</li><li>Incident management including root cause analysis and remediation.</li><li>Security and compliance management with centralized logging, threat analysis and remediation.</li><li>Proactive system analysis, tuning and optimization.</li></ul><p> </p><p> </p><p>QUALIFICATIONS:</p><p> </p><ul><li>Passion for emerging technologies and love keeping up with the latest technology trends.</li><li>Customer centric, and realize the value of providing excellent customer service.</li><li>Proven leadership skills and the ability to motivate teams. Exceptional abilities at mentoring and engaging others, empowering teams and inspiring them to excellence</li><li>Strong written and oral communications skills and the ability to communicate with all levels of users/management</li><li>Strong organization skills, interpersonal skills and excellent attention to details</li><li>Ability to understand and apply new technologies with a strong desire to learn and improve</li><li>Ability to effectively prioritize, make decisions, solve problems and execute tasks in a high-pressure environment</li><li>Ability to work independently and within a team on multiple simultaneous tasks within a challenging fast paced customer-oriented environment.</li><li>Thorough understanding of Internet architectures;</li><li>5+ years’ System Administration experience in a large-scale, multi-OS (Linux/Windows), high-availability environments</li><li>3+ years’ experience with Microsoft services and configuration: IIS, Active Directory &amp; SQL Server</li><li>3+ years’ experience working with Oracle WebLogic and Database</li><li>3+ years’ experience with cloud computing in AWS or Azure</li><li>1+ years’ experience with big data technologies: Spark, Kafka, Cassandra, Play / Akka, Oracle Golden Gate</li><li>Experience setting up and regularly using monitoring, trending and logging tools (HP Operations Management, Oracle Enterprise Manager, Dynatrace, DataDog, Azure Diagnostics, AWS CloudWatch)</li><li>Experience with revision control systems and usage for managing systems configuration: Git, SVN etc.</li><li>Experience with managing, operating and monitoring backup systems</li><li>Familiarity with fundamental networking/distributed computing environment concepts; can configure SMB/NFS, key-based auth; DNS; familiar with basic networking concepts: switching, routing, OSI network layers, firewalls, load-balancing at various layers, SMTP, HTTP, SSL, SSH, AD, LDAP, VPN</li><li>Understanding of programming and scripting languages (Bash, Python, Java, Ruby)</li><li>Understanding of containerization &amp; orchestration: Docker, CoreOS, Kubernetes, auto-scaling and self-healing systems.</li></ul><div><strong>Shift:</strong> Day</div><div><strong>Length of Contract:</strong> Not Applicable (Regular Position)</div><div><strong>Work Location: </strong>8200 Dixie Road (101), Brampton, ON </div><div><strong>Travel Requirements:</strong> Up to 10%</div><div><strong>Posting Category/Function: </strong>Technology &amp; Systems Administration</div><div><strong>Requisition ID:</strong> 99253</div><div> </div><div><b>WHY ROGERS?</b></div><div> </div><div>As a proud Canadian company, we're dedicated to making things easier for our customers. We’ve been embracing and leading change for over 50-years, and we’ll continue to seek out new opportunities to bring our customers simple solutions for today and tomorrow.</div><div> </div><div>At Rogers, we recognize that success is determined by the strength and diversity of our people. We work together because we want to win together, and these five shared values guide and define our work:</div><div> </div><ol><li>Simplify and innovate</li><li>Take ownership of the what and the how</li><li>Equip people to succeed</li><li>Execute with discipline and pride</li><li>Talk straight, build trust, and over deliver</li></ol><div> </div><div>Why Rogers? Because we believe the best is yet to come.</div><div> </div><div><em>We recognize the business value in creating a workplace where each team member has the tools to reach their full potential. At Rogers, we value the insights and innovation that diverse teams bring to work. We work with our candidates with disabilities throughout the recruitment process to ensure that they have what they need to be at their best. Please reach out to our recruiters and hiring managers to begin a conversation about how we can ensure that you deliver your best work. You can also reach out to our team at <a href=\"mailto:RogersRecruiting@rci.rogers.com\">RogersRecruiting@rci.rogers.com</a> to begin a conversation about your individual accessibility needs throughout the hiring process.</em></div><div> </div><div>Posting Notes:  Information Technology &amp; Engineering || Canada (CA) || ON || Brampton || SF:LI-LW1 ||</div><p> </p></span><p class=\"job-location\"><span class=\"jobmarkets\"></span></p></div>"},
{"title": "Conseillers(ères) aux ventes - Place Laurier # 5257", "job_posted": "2017-08-05", "job_location": "Sainte-Foy, QC, CA, G1V 4J8", "province_name": "QC", "job_detail": "<div class=\"job\"><span itemprop=\"description\"><div>Chez Rogers, nous vous aiderons à mener une carrière fructueuse. Que vous soyez développeur, analyste ou conseiller, vous serez ici au bon endroit pour concrétiser vos idées. Nous acceptons le changement et nous trouvons des moyens de faire mieux. Nous respectons cet engagement en offrant à nos employés une culture d’entreprise basée sur la passion et l’innovation.</div><div> </div><div> </div><p>Nos conseillers aux ventes se passionnent non seulement pour les technologies de pointe et le contenu auquel elles donnent naissance, mais ils en font leur pain quotidien. Nous souhaitons que les membres de notre équipe soient enthousiastes à l’égard de nos produits et services, et qu’ils veuillent partager leurs connaissances et leur expérience avec les autres. Chez <em>Rogers</em>, les Ventes au détail jouent un rôle important… tout comme vous.</p><p>Nous sommes à la recherche de conseillers aux ventes accueillants et accessibles qui possèdent une solide expérience en vente afin de pourvoir des postes <strong>à temps partiel </strong>dans notre magasin de Place Laurier # 5257. Vous devrez bâtir des relations solides avec la clientèle, prendre en charge la résolution des problèmes des clients et agir à titre d’ambassadeur de Rogers.</p><p> </p><p><strong>Expérience</strong></p><ul><li>Vous possédez une expérience démontrée dans le secteur des ventes, idéalement dans le domaine des télécommunications, de la technologie ou de la vente au détail.</li><li>Vous savez atteindre des objectifs de vente individuels.</li><li>Vous avez la volonté d’offrir un service à la clientèle et une expérience de vente hors pair.</li><li>Vous êtes friand de technologie et désirez en apprendre davantage sur l’industrie des technologies et des télécommunications.</li><li>Vous faites preuve de créativité et savez travailler dans un environnement de vente dynamique.</li><li>Vous avez l’esprit d’équipe et une approche proactive.</li><li>Si vous maîtrisez d’autres langues, cela constituerait un atout.</li><li>Vous êtes disponible pour travailler selon un horaire variable et flexible<em> (du lundi au dimanche)</em>.</li></ul><p> </p><p><strong>Avantages pour vous</strong></p><ul><li>Taux horaire de base et système de commissions concurrentiels</li><li>Horaire flexible</li><li>Régimes complets de soins de santé et de soins dentaires pour les employés à temps plein et à temps partiel</li><li>Excellents programmes d’achat d’actions et d’accumulation de capital</li><li>Rabais pour les employés sur l’ensemble des services de Rogers et de Fido</li><li>Employeur ayant un engagement continu envers le personnel et son perfectionnement</li><li>Programmes de reconnaissance des employés</li><li>Poste admissible aux heures supplémentaires</li></ul><p> </p><p><strong>Dans le cadre du processus de recrutement, les candidats retenus devront consentir à la vérification de leurs antécédents judiciaires.</strong></p><div> </div><div> </div><div><b>Horaire :</b> Temps partiel </div><div><b>Quart de travail :</b> Variable</div><div><b>Durée du contrat :</b> Ne s’applique pas (poste régulier)</div><div><b>Lieu de travail :</b> 2700 boul Laurier Unit 75 (5257), Sainte-Foy, QC</div><div><b>Déplacement :</b> Aucun</div><div><b>Catégorie d’affichage/fonction : </b>Vente au détail (En magasin/Horaire) &amp; Vente et Service</div><div><b>Identifiant de réquisition:</b> 104645</div><div> </div><div><p><b>POURQUOI CHOISIR ROGERS?</b></p><p>En tant que fière entreprise canadienne, nous sommes déterminés à faciliter les choses pour nos clients. Nous ouvrons la voie du changement depuis plus d'un demi-siècle et nous continuerons de chercher des occasions de présenter à nos clients des solutions simples pour aujourd'hui et pour demain.</p><p>Chez Rogers, c’est la force et la diversité de nos employés qui détermine notre succès. Nous travaillons ensemble pour gagner ensemble et ces cinq valeurs communes guident la façon dont nous travaillons.</p><ol><li>Simplifier et innover</li><li>Assumer la responsabilité « du quoi et du comment »</li><li>Outiller nos employés pour qu'ils réussissent</li><li>Exécuter les tâches avec discipline et fierté</li><li>Faire preuve de franchise, tisser des liens de confiance et surpasser les attentes</li></ol><p>Pourquoi choisir Rogers? Parce que votre avenir inspire notre quotidien.</p><p> </p></div><div>Nous puisons notre force dans nos différences. Rogers est fermement engagée à promouvoir la diversité et l’inclusion. Toutes les candidatures reçues seront prises en compte.</div><div> </div><div><p><i>Rogers souhaite offrir à ses employés un environnement de travail où ils trouveront les outils nécessaires à leur plein épanouissement. Nous valorisons la diversité, qui amène un flot d’idées et d’opinions perspicaces et novatrices. Tout au long du processus de recrutement, nous dialoguons avec nos candidats atteints d’un handicap physique pour nous assurer qu’ils puissent donner le meilleur d’eux-mêmes. Veuillez communiquer avec nos recruteurs et avec nos gestionnaires de l’embauche pour discuter des améliorations qui vous permettront de donner le meilleur de vous-même. Par ailleurs, durant le processus d’embauche, vous pouvez écrire à <a href=\"mailto:RogersRecruiting@rci.rogers.com\">RogersRecruiting@rci.rogers.com</a> pour préciser vos besoins en matière d’accessibilité.</i></p></div><div> </div><div>Posting Notes:  Vente au détail || Canada (CA) || QC || Sainte-Foy || Aucun ||</div><div> </div></span><p class=\"job-location\"><span class=\"jobmarkets\"></span><span class=\"jobsegments\"><br/><strong>Segment de l'offre d'emploi: </strong><span itemprop=\"industry\">Franchise, Retail                    </span></span></p></div>"},
{"title": "Sales Associate - Rogers Cambridge Centre", "job_posted": "Aug 5, 2017", "job_location": "Cambridge, ON, CA, N1R 6B3", "province_name": "ON", "job_detail": "<div class=\"job\"><span itemprop=\"description\"><p>At Rogers we’re for supporting you on a journey to a rewarding career. Whether you’re a developer, an analyst, or a customer care consultant, Rogers is the place where ideas become reality. We embrace change, and find ways to do better. And we deliver on that commitment by fostering an environment of passion and innovation for all people.</p><p> </p><p>Our Sales Associates don’t just embrace the latest technology and content – it’s part of who they are. We want people on our team who are excited about our products and services and want to share their knowledge and experience with others. At Rogers, retail has impact, and so can you.</p><p>We’re looking for outgoing, approachable sales associates with a proven track record in sales to join our Caimbridge Centre store on a part time basis. You’ll build and establish customer relationships, own the resolution of customer issues, and act as a Rogers ambassador.</p><p><b>Your Experience</b></p><ul><li>Proven success in a sales role, ideally within telecommunications, technology or retail</li><li>A sales professional with an ability to achieve individual sales targets</li><li>A passion for delivering exceptional customer service and sales experience</li><li>Tech savvy and eager to learn about technology and the telecom industry</li><li>An ability to think outside of the box and work in a fast-paced retail sales role</li><li>A proactive team player</li><li>Additional languages are an asset</li><li>An ability to work a varied and flexible schedule (20-30 hours per week, Monday – Sunday)</li></ul><p><b>Benefits for You</b></p><ul><li>Base hourly rate and competitive commission structure</li><li>Flexible schedule</li><li>Comprehensive health and dental plan for full time and part time employees</li><li>Outstanding share options and wealth accumulation programs</li><li>Employee discounts across Rogers &amp; Fido services</li><li>A company committed to investing in and developing our own talent</li><li>Employee recognition programs</li><li>Overtime pay eligible</li></ul><p><b>As part of the recruitment process, candidates will be required to provide consent for and successfully pass a criminal background check.</b></p><div> </div><div><b>Schedule:</b> Part Time</div><div><b>Shift:</b> Variable</div><div><b>Length of Contract:</b> Not Applicable (Regular Position)</div><div><b>Work Location: </b>355 Hespeler Rd. Unit 175 (5404), Cambridge, ON </div><div><b>Travel Requirements:</b> None</div><div><b>Posting Category/Function: </b>Retail (In Store / Hourly) &amp; Sales and Service</div><div><b>Requisition ID:</b> 104654</div><div> </div><div><b>WHY ROGERS?</b></div><div> </div><div>As a proud Canadian company, we're dedicated to making things easier for our customers. We’ve been embracing and leading change for over 50-years, and we’ll continue to seek out new opportunities to bring our customers simple solutions for today and tomorrow.</div><div> </div><div>We recognize that success is determined by the strength and diversity of our people. We work together because we want to win together, and these five shared values guide and define our work:</div><div> </div><ol><li>Simplify and innovate</li><li>Take ownership of the what and the how</li><li>Equip people to succeed</li><li>Execute with discipline and pride</li><li>Talk straight, build trust, and over deliver</li></ol><div> </div><div>Why Rogers?  Because your tomorrow inspires our today.</div><div> </div><div>What makes us different makes us stronger. Rogers has a strong commitment to diversity and inclusion. Everyone who applies for a job will be considered.</div><div> </div><div><i>We recognize the business value in creating a workplace where each team member has the tools to reach their full potential. At Rogers, we value the insights and innovation that diverse teams bring to work. We work with our candidates with disabilities throughout the recruitment process to ensure that they have what they need to be at their best. Please reach out to our recruiters and hiring managers to begin a conversation about how we can ensure that you deliver your best work. You can also reach out to our team at <a href=\"mailto:RogersRecruiting@rci.rogers.com\">RogersRecruiting@rci.rogers.com</a></i> to begin a conversation about your individual accessibility needs throughout the hiring process.</div><div> </div><div>Posting Notes:  Retail || Canada (CA) || ON || Cambridge || Retail ||</div><p> </p></span><p class=\"job-location\"><span class=\"jobmarkets\"></span></p></div>"},
{"title": "Senior Investigator - Damage Claims", "job_posted": "Aug 6, 2017", "job_location": "Brampton, ON, CA, L6T 0C1", "province_name": "ON", "job_detail": "<div class=\"job\"><span itemprop=\"description\"><p>At Rogers we’re for supporting you on a journey to a rewarding career. Whether you’re a developer, an analyst, or a customer care consultant, Rogers is the place where ideas become reality. We embrace change, and find ways to do better. And we deliver on that commitment by fostering an environment of passion and innovation for all people.</p><p> </p><p>Reporting to the Manager - Damage Claims &amp; Operations Support (DCOS) the successful candidate will be experienced in complex damage liability and general investigations. The candidate must have a demonstrated ability to be a team player, experienced at multi-tasking, and able to work under tight timelines. Excellent communications skills – both written and verbal are essential. Ability to prepare detailed investigation reports in a timely manner for submission to various management and judicial proceedings. The candidate must be able to: demonstrate professionalism and objectivity under all circumstances; be capable of taking initiative; function in an independent manner, be able to establish effective relationships with key internal and external partners; and, be one of the points of contact with various government and non-government agencies. The candidate will have the ability to work outdoors (construction sites) under adverse weather conditions and be on call on a rotational basis.<br/><br/>\rResponsibilities Include</p><ul><li>Conduct and lead a variety of damage, liability (first and third party) and general investigations utilizing established investigative procedures and techniques to Rogers Communications’ (Rogers) property;</li><li>Assist in damage awareness and prevention aspects of Rogers’ risk management activities;</li><li>Liaise between Rogers and various agencies (government and non-government) with respect to investigations, and develop and maintain a strong and productive working relationship with those agencies;</li><li>Ensure that accurate, timely and detailed documentation is prepared, to standards acceptable to the courts, to facilitate effective and efficient investigations and results;</li><li>Conduct special projects as requested by Management;</li><li>Assist the Manager, DCOS Unit with the preparation of periodic reports to Management;</li><li>Represent the DCOS on committees and/or focus groups as required;    </li><li>Identify and share new damage/liability trends, and significant control weaknesses or deficiencies identified during the course of investigations;</li><li>Develop and maintain a network of internal &amp; external contacts, including key personnel within other utilities, to assist Rogers with damage investigations and prevention;</li></ul><p> </p><p>Qualifications: </p><ul><li>Minimum of fifteen (15) years of experience in the area of investigating damage, liability, telecommunications investigations (first and third party) or related experience;</li><li>Demonstrated ability to conduct effective interviews with witnesses, and any other persons connected to events;</li><li>Thorough knowledge of the judiciary system, namely civil processes and the rules of admissibility of evidence;</li><li>Demonstrated ability to make independent, sound decisions within tight time frames that reflect depth of knowledge;</li><li>Ability to negotiate damage settlements with insurance companies and other parties responsible for damaging Rogers’ property.</li><li>Ability to prioritize workload to meet deadlines and priorities;</li><li>Ability to interact in a positive manner with contractors;</li><li> Ability to work in a team environment and contribute to a positive working environment;</li><li>Ability to facilitate meetings and present publicly to groups ranging from four to twenty individuals;</li><li>Creative initiative-taker in seeking optimum solutions to a problem;</li><li>Advanced knowledge of Microsoft Outlook, Word, Excel, Power Point, CRM;</li><li>Ability to acquire skills with internal IT applications and systems used by the DCOS Unit;</li><li>Ability to work under all types of weather conditions;</li><li>Ability to work independently with minimal supervision;</li><li>Ability to be on-call and work overtime/ flexible shifts in the evening and on weekends when required.</li><li>Knowledge of Telecommunications Network an asset.</li></ul><p> </p><p>Requirements</p><ul><li>The position is based in Brampton (8200 Dixie Road) and travel within Ontario and may require some travel outside of Ontario;</li><li>Excellent verbal and written communication skills and the ability to write clear and concise reports;</li><li>Must possess a valid Ontario driver’s license and have a good driving record.</li><li>Possess post-secondary education or equivalent.</li><li>Knowledge of cable/telecom construction standards </li><li>Knowledge of Locates and the Locate process.<br/>\r\t </li></ul><div> </div><div><b>Schedule:</b> Full Time</div><div><b>Shift:</b> Day</div><div><b>Length of Contract:</b> Not Applicable (Regular Position)</div><div><b>Work Location: </b>8200 Dixie Road (101), Brampton, ON </div><div><b>Travel Requirements:</b> Up to 10%</div><div><b>Posting Category/Function: </b>Field Operations &amp; Inspection</div><div><b>Requisition ID:</b> 104325</div><div> </div><div><b>WHY ROGERS?</b></div><div> </div><div>As a proud Canadian company, we're dedicated to making things easier for our customers. We’ve been embracing and leading change for over 50-years, and we’ll continue to seek out new opportunities to bring our customers simple solutions for today and tomorrow.</div><div> </div><div>We recognize that success is determined by the strength and diversity of our people. We work together because we want to win together, and these five shared values guide and define our work:</div><div> </div><ol><li>Simplify and innovate</li><li>Take ownership of the what and the how</li><li>Equip people to succeed</li><li>Execute with discipline and pride</li><li>Talk straight, build trust, and over deliver</li></ol><div> </div><div>Why Rogers?  Because your tomorrow inspires our today.</div><div> </div><div>What makes us different makes us stronger. Rogers has a strong commitment to diversity and inclusion. Everyone who applies for a job will be considered.</div><div> </div><div><i>We recognize the business value in creating a workplace where each team member has the tools to reach their full potential. At Rogers, we value the insights and innovation that diverse teams bring to work. We work with our candidates with disabilities throughout the recruitment process to ensure that they have what they need to be at their best. Please reach out to our recruiters and hiring managers to begin a conversation about how we can ensure that you deliver your best work. You can also reach out to our team at <a href=\"mailto:RogersRecruiting@rci.rogers.com\">RogersRecruiting@rci.rogers.com</a></i> to begin a conversation about your individual accessibility needs throughout the hiring process.</div><div> </div><div>Posting Notes:  Information Technology &amp; Engineering || Canada (CA) || ON || Brampton || SF:LI-DG1 ||</div><p> </p></span><p class=\"job-location\"><span class=\"jobmarkets\"></span></p></div>"},
{"title": "Sales Associate - Camrose Commons", "job_posted": "Aug 6, 2017", "job_location": "Camrose, AB, CA, T4V 4W1", "province_name": "AB", "job_detail": "<div class=\"job\"><span itemprop=\"description\"><p>At Rogers we’re for supporting you on a journey to a rewarding career. Whether you’re a developer, an analyst, or a customer care consultant, Rogers is the place where ideas become reality. We embrace change, and find ways to do better. And we deliver on that commitment by fostering an environment of passion and innovation for all people.</p><p> </p><p><b>Sales Associate</b></p><p>Our Sales Associates make every customer feel welcome and leave delighted, more knowledgeable, and feeling better about Rogers and Fido every time. They know how to engage, show they care and invest the time with our customers to get things done. They want every customer sharing their experience and always coming back.</p><p>At Rogers, retail has impact, and so can you.</p><p><b>In this role you will:</b></p><ul><li>Deliver a superior and consistent customer experience</li><li>Be the first to learn about new products and services</li><li>Handle all issues and concerns – you're the one-stop resolution for our customers</li><li>Meet and exceed monthly sales targets</li><li>Work in a fast-paced environment that requires a high degree of multi-tasking</li><li>Work with and through others to achieve team goals in a highly collaborative environment</li><li>Be able to work a varied and flexible schedules <b>(Monday – Sunday)</b></li></ul><p><b>You are someone who: </b></p><ul><li>Knows how to greet and thank our customers – you want everyone to feel welcome and appreciated</li><li>Has a knack for building rapport – you genuinely care about our customers’ needs. It’s not just about the sale!</li><li>Ensures our customers understand our products and services </li><li>Enjoys solving customer problems – you take accountability for their issues</li><li>Is comfortable taking action, showing initiative and feels empowered to lead</li><li>Takes pride in their work environment and wants to see the team succeed</li><li>Acts as a brand ambassador, an educator, a leader, a problem solver, and so much more!</li></ul><p><b>Benefits for you:</b></p><ul><li>We invest in you, just as much as you invest in us</li><li>Base hourly rate and competitive commission structure</li><li>Opportunities to grow and develop your career</li><li>Strong internal development programs</li><li>Comprehensive health and dental plan for full time and part time employees</li><li>Outstanding share options and wealth accumulation programs</li><li>Employee discounts across Rogers &amp; Fido services</li><li>Overtime pay eligible</li></ul><p>As part of the recruitment process, candidates will be required to provide consent for and successfully pass a criminal background check.</p><div> </div><div><b>Schedule:</b> Part Time</div><div><b>Shift:</b> Variable</div><div><b>Length of Contract:</b> 12 Months</div><div><b>Work Location: </b>6805 - 48 Avenue, Unit 345 (5683), Camrose, AB </div><div><b>Travel Requirements:</b> Up to 25%</div><div><b>Posting Category/Function: </b>Retail (In Store / Hourly) &amp; Sales and Service</div><div><b>Requisition ID:</b> 107348</div><div> </div><div><b>WHY ROGERS?</b></div><div> </div><div>As a proud Canadian company, we're dedicated to making things easier for our customers. We’ve been embracing and leading change for over 50-years, and we’ll continue to seek out new opportunities to bring our customers simple solutions for today and tomorrow.</div><div> </div><div>We recognize that success is determined by the strength and diversity of our people. We work together because we want to win together, and these five shared values guide and define our work:</div><div> </div><ol><li>Simplify and innovate</li><li>Take ownership of the what and the how</li><li>Equip people to succeed</li><li>Execute with discipline and pride</li><li>Talk straight, build trust, and over deliver</li></ol><div> </div><div>Why Rogers?  Because your tomorrow inspires our today.</div><div> </div><div>What makes us different makes us stronger. Rogers has a strong commitment to diversity and inclusion. Everyone who applies for a job will be considered.</div><div> </div><div><i>We recognize the business value in creating a workplace where each team member has the tools to reach their full potential. At Rogers, we value the insights and innovation that diverse teams bring to work. We work with our candidates with disabilities throughout the recruitment process to ensure that they have what they need to be at their best. Please reach out to our recruiters and hiring managers to begin a conversation about how we can ensure that you deliver your best work. You can also reach out to our team at <a href=\"mailto:RogersRecruiting@rci.rogers.com\">RogersRecruiting@rci.rogers.com</a></i> to begin a conversation about your individual accessibility needs throughout the hiring process.</div><div> </div><div>Posting Notes:  Retail || Canada (CA) || AB || Camrose || Retail ||</div><p> </p></span><p class=\"job-location\"><span class=\"jobmarkets\"></span></p></div>"},
{"title": "Network Specialist", "job_posted": "Aug 6, 2017", "job_location": "Brampton, ON, CA, L6T 0C1", "province_name": "ON", "job_detail": "<div class=\"job\"><span itemprop=\"description\"><p>At Rogers we’re for supporting you on a journey to a rewarding career. Whether you’re a developer, an analyst, or a customer care consultant, Rogers is the place where ideas become reality. We embrace change, and find ways to do better. And we deliver on that commitment by fostering an environment of passion and innovation for all people.</p><p> </p><p>This position provides operational support for Data, Voice and Entertainment platforms, the Corporate and Wireless networks, and to the NOC.  It includes the configuration and provisioning of access network devices in the Wireline Access Network.  The areas of responsibility are; IP Management, Configuration Management and Capacity Augmentation with focus on IPv4/IPv6 management and switch and port assignments for optimum performance and within capacity constraints.<br/>\r <br/>\rExpectation of Role<br/>\rYou will be expected to be proactive in developing/contributing techniques and processes to effectively manage and support the devices and services end to end.  This involves both hardware and software, from a security and daily operational perspective to ensure consistency with industry standards, internal policies and forward looking precautions.<br/>\r <br/>\rResponsibilities</p><ul><li>Provide support with the commissioning, provisioning, and proactive maintenance of core and access network components of all services.</li><li>Provide technical support on problem service outages.</li><li>Actively participate in all projects related to the services Provisioning Operations supports; such as upgrades, modifications, augmentations and new service introduction.</li><li>Proactively monitor provisioning faults for root cause determination and recommendations based on findings.</li><li>Achieve a high level of security on platforms managed by Provisioning Operations, by minimizing the vulnerabilities and by following guidelines from the vendors, engineering and the Network Security team.</li><li>Develop and review all MOP’s (Method of Procedure) prior to any change control activities to ensure impact to customers is minimized.  Work with other functional groups such as the NOC and other platforms (Network Planning, Management &amp; Control Network, IP Core Server Operations) to review and approve proposed change activities.</li><li>Develops all documentation including methods of procedure, methods of restoration, backup procedures. Adhere to all policy and legal requirements under Health and Safety legislation.</li></ul><p> <br/>\rKey Accountabilities</p><ul><li>Ensure all customer data and information is secure from all unauthorized person(s).</li><li>Ensure best interest of Rogers and its business is prioritized.</li><li>Ensure risks associated with business or service is mitigated to highest degree of control.</li><li>Ensure all documentation such as but not limited to MOPs are complete with all relevant information and is reviewed by senior specialist prior to implementation.</li><li>Ensure system access policies are adhered to, acquiring exemption authorization where needed.</li><li>Ensure all policies and standards listed in Rogers’ literature are met and adhered to at all time.</li><li>Ensure business requirements are prioritized when on-call.</li><li>Ensure service delivery and customer satisfaction.</li><li>Ensure minimal, if any impact to customer service or the business when making changes in the network.</li><li>Ensure support is available from senior specialists if and when need arises thus minimize risks.</li></ul><p> <br/>\rQualifications </p><ul><li>Must have a technical college diploma or university graduate in a technology discipline (Computer Science, Computer Networking, Electrical Engineering).</li><li>Must have a technical understanding of TCP/IP and subnetting.</li><li>Must have experience with Cisco UBR10K, RFGW10 and Nexus Switch devices.  Experience with CASA devices is an asset.</li><li>Must have experience with networking, Cisco and Juniper routers and UNIX servers such as SUN or HP.</li><li>Must have a minimum of five years’ experience in Cable, Telecommunications or Internet in a Network Operations or Network Engineering environment.</li><li>Must be experienced in process development.</li><li>Must be proficiency with Microsoft Office, Visio and MS Project.</li><li>Core values; customer focus, team work, communication, accountability and innovation.</li><li>Role Specific Competencies; integrity, adaptability, problem solving, achievement orientation, listening, understanding and responding.</li><li>Ability to work both independently and as part of a team.</li><li>A high level of attention to detail and follow through.</li><li>Proven ability to produce results.</li><li>Excellent organizational and interpersonal skills.</li><li>Must be reliable and conscientious.</li><li>Must be available to work in a rotating on-call environment.</li><li>Must be a team player.</li><li>Must be able to work any shift as required.</li></ul><div> </div><div><b>Schedule:</b> Full Time</div><div><b>Shift:</b> Variable</div><div><b>Length of Contract:</b> Not Applicable (Regular Position)</div><div><b>Work Location: </b>8200 Dixie Road (101), Brampton, ON </div><div><b>Travel Requirements:</b> None</div><div><b>Posting Category/Function: </b>Technology &amp; Engineering</div><div><b>Requisition ID:</b> 105092</div><div> </div><div><b>WHY ROGERS?</b></div><div> </div><div>As a proud Canadian company, we're dedicated to making things easier for our customers. We’ve been embracing and leading change for over 50-years, and we’ll continue to seek out new opportunities to bring our customers simple solutions for today and tomorrow.</div><div> </div><div>We recognize that success is determined by the strength and diversity of our people. We work together because we want to win together, and these five shared values guide and define our work:</div><div> </div><ol><li>Simplify and innovate</li><li>Take ownership of the what and the how</li><li>Equip people to succeed</li><li>Execute with discipline and pride</li><li>Talk straight, build trust, and over deliver</li></ol><div> </div><div>Why Rogers?  Because your tomorrow inspires our today.</div><div> </div><div>What makes us different makes us stronger. Rogers has a strong commitment to diversity and inclusion. Everyone who applies for a job will be considered.</div><div> </div><div><i>We recognize the business value in creating a workplace where each team member has the tools to reach their full potential. At Rogers, we value the insights and innovation that diverse teams bring to work. We work with our candidates with disabilities throughout the recruitment process to ensure that they have what they need to be at their best. Please reach out to our recruiters and hiring managers to begin a conversation about how we can ensure that you deliver your best work. You can also reach out to our team at <a href=\"mailto:RogersRecruiting@rci.rogers.com\">RogersRecruiting@rci.rogers.com</a></i> to begin a conversation about your individual accessibility needs throughout the hiring process.</div><div> </div><div>Posting Notes:  Information Technology &amp; Engineering || Canada (CA) || ON || Brampton || SF:LI-DG1 ||</div><p> </p></span><p class=\"job-location\"><span class=\"jobmarkets\"></span></p></div>"},
{"title": "Assistant Store Manager Fido Weston & Rutherford", "job_posted": "Aug 6, 2017", "job_location": "Woodbridge, ON, CA, L4H 2P8", "province_name": "ON", "job_detail": "<div class=\"job\"><span itemprop=\"description\"><p>At Rogers we’re for supporting you on a journey to a rewarding career. Whether you’re a developer, an analyst, or a customer care consultant, Rogers is the place where ideas become reality. We embrace change, and find ways to do better. And we deliver on that commitment by fostering an environment of passion and innovation for all people.</p><p> </p><p>Our Assistant Store Managers play an important role on our retail team. They’re coaches, cheerleaders, and exceptional sales people who go above and beyond to help their team be successful.</p><p>We’re currently looking for an exceptional leader to help our Fido Woodbridge store deliver for our customers. They’ll have a hand in driving sales, supporting daily in-store operations, and training and developing strong teams.</p><p>We’re dedicated to making things simpler for our customers, and we want people on our team who listen to and understand what our customers want and need. At Fido, retail has impact, and so can you.</p><p><b>Your Experience</b></p><ul><li>A confident self-starter and enthusiastic leader, ready to drive sales across the store</li><li>An ability to establish strong relationships with staff to ensure open lines of communication for coaching and training</li><li>Understanding of basic coaching and training tips – you’ll be working closely with our Sales Associates on a daily basis</li><li>Proven ability to achieve and exceed sales and service targets</li><li>Outstanding communication and negotiation skills with an ability to deal with customers effectively</li><li>Minimum 1 years’ experience in a senior telecommunications sales role, Rogers/Fido retail or Rogers call centre experience would be an asset</li><li>Attention to detail in all aspects of store operations and procedures</li></ul><p><b>Benefits for You</b></p><ul><li>Competitive pay and bonus structure</li><li>Comprehensive health and dental plan options</li><li>Outstanding share options and wealth accumulation programs</li><li>Employee discounts across Rogers &amp; Fido services</li><li>Eligible for overtime pay</li><li>Employee recognition programs</li><li>A company committed to investing in and developing our own talent</li></ul><p><b>As part of the recruitment process, candidates will be required to provide consent for and successfully pass a criminal background and credit history check.</b></p><div> </div><div><b>Schedule:</b> Full Time</div><div><b>Shift:</b> Variable</div><div><b>Length of Contract:</b> Not Applicable (Regular Position)</div><div><b>Work Location: </b>9200 Weston Rd (384), Woodbridge, ON </div><div><b>Travel Requirements:</b> Up to 10%</div><div><b>Posting Category/Function: </b>Retail (Store Management / Corporate) &amp; Store Management</div><div><b>Requisition ID:</b> 106177</div><div> </div><div><b>WHY ROGERS?</b></div><div> </div><div>As a proud Canadian company, we're dedicated to making things easier for our customers. We’ve been embracing and leading change for over 50-years, and we’ll continue to seek out new opportunities to bring our customers simple solutions for today and tomorrow.</div><div> </div><div>We recognize that success is determined by the strength and diversity of our people. We work together because we want to win together, and these five shared values guide and define our work:</div><div> </div><ol><li>Simplify and innovate</li><li>Take ownership of the what and the how</li><li>Equip people to succeed</li><li>Execute with discipline and pride</li><li>Talk straight, build trust, and over deliver</li></ol><div> </div><div>Why Rogers?  Because your tomorrow inspires our today.</div><div> </div><div>What makes us different makes us stronger. Rogers has a strong commitment to diversity and inclusion. Everyone who applies for a job will be considered.</div><div> </div><div><i>We recognize the business value in creating a workplace where each team member has the tools to reach their full potential. At Rogers, we value the insights and innovation that diverse teams bring to work. We work with our candidates with disabilities throughout the recruitment process to ensure that they have what they need to be at their best. Please reach out to our recruiters and hiring managers to begin a conversation about how we can ensure that you deliver your best work. You can also reach out to our team at <a href=\"mailto:RogersRecruiting@rci.rogers.com\">RogersRecruiting@rci.rogers.com</a></i> to begin a conversation about your individual accessibility needs throughout the hiring process.</div><div> </div><div>Posting Notes:  Retail || Canada (CA) || ON || Woodbridge || Retail ||</div><p> </p></span><p class=\"job-location\"><span class=\"jobmarkets\"></span></p></div>"},
{"title": "Program Coordinator", "job_posted": "Aug 6, 2017", "job_location": "Mississauga, ON, CA, L5T 2P9", "province_name": "ON", "job_detail": "<div class=\"job\"><span itemprop=\"description\"><div>Every day, we strive to build a brilliant digital future for Canadians. We work as one team, with one goal – serve our customers better.</div><div> </div><p>Reporting to the Sr. Manager Customer Care Support, the Program Coordinator will work closely with the Management team to identify areas of opportunity within the Customer Care Centre; based on customer response, agent feedback and process effectiveness. The incumbent will manage on going customer care centre programs; develop recommendations for improvements on the day to day operations of the CCC, and roll out new processes, audit programs and procedures.</p><p> </p><p><strong><u>Responsibilities</u></strong></p><p> </p><ul><li>Manage day to day Customer Care Centre (CCC) programs supporting KPIs and Customer Experience</li><li>Provide daily/weekly/monthly reporting on performance /impact of call center programs</li><li>Provide monthly insight reporting on customer impacting issues, and products related feedback</li></ul><ul><li>Review and assess business needs within the CCC</li><li>Identify process/procedures that are out of control</li><li>Conduct Impact analysis</li><li>Initiate/deploy enhancements</li><li>Conduct post deployment reviews/ audits</li><li>Develop and maintain departmental SOPs and process maps</li></ul><p> </p><p><strong><u>Qualifications</u></strong></p><p> </p><ul><li>Post-secondary degree</li><li>3-5 years’ experience in the Contact Centre industry with a minimum of 1-2 years’ experience specific to Performance Analytics</li><li>Experience with Six Sigma methodologies</li><li>Additional experience related to Contact Centre Agent Coaching / Team Management is a definite asset</li><li>Advanced knowledge of Excel with a high level of proficiency in MS Office (PowerPoint, Word)</li><li>High level of accuracy and detail-oriented</li><li>Excellent written &amp; verbal communication skills, and interpersonal skills</li><li>Strong team and customer service orientation required.</li><li>Ability to communicate and present findings in a succinct and professional manner</li><li>Ability to teach, coach and mentor peers and superiors on contact centre KPIs</li><li>Ability to network across functional teams and build strong relationships</li><li>Knowledge of contact centre performance management and coaching techniques</li><li>Strong organizational, planning and time management skills; multi-task oriented</li><li>Strong accountability to meet deadlines</li><li>Proven ability to work independently and take initiative within a fast paced team environment</li></ul><p> </p><p> </p><div><strong>Schedule:</strong> Full Time</div><div><strong>Shift:</strong> Day</div><div><strong>Length of Contract:</strong> Not Applicable (Regular Position)</div><div><strong>Work Location: </strong>59 Ambassador Dr (096), Mississauga, ON </div><div><strong>Travel Requirements:</strong> None</div><div><strong>Posting Category/Function: </strong>Call Centre Operations &amp; Operations Support</div><div><strong>Requisition ID:</strong> 102103</div><div> </div><div><b>WHY ROGERS?</b></div><div> </div><div>As a proud Canadian company, we're dedicated to making things easier for our customers. We’ve been embracing and leading change for over 50-years, and we’ll continue to seek out new opportunities to bring our customers simple solutions for today and tomorrow.</div><div> </div><div>At Rogers, we recognize that success is determined by the strength and diversity of our people. We work together because we want to win together, and these five shared values guide and define our work:</div><div> </div><ol><li>Simplify and innovate</li><li>Take ownership of the what and the how</li><li>Equip people to succeed</li><li>Execute with discipline and pride</li><li>Talk straight, build trust, and over deliver</li></ol><div> </div><div>Why Rogers? Because we believe the best is yet to come.</div><div> </div><div><em>We recognize the business value in creating a workplace where each team member has the tools to reach their full potential. At Rogers, we value the insights and innovation that diverse teams bring to work. We work with our candidates with disabilities throughout the recruitment process to ensure that they have what they need to be at their best. Please reach out to our recruiters and hiring managers to begin a conversation about how we can ensure that you deliver your best work. You can also reach out to our team at <a href=\"mailto:RogersRecruiting@rci.rogers.com\">RogersRecruiting@rci.rogers.com</a> to begin a conversation about your individual accessibility needs throughout the hiring process.</em></div><div> </div><div>Posting Notes:  Call Centre || Canada (CA) || ON || Mississauga || None ||</div><p> </p></span><p class=\"job-location\"><span class=\"jobmarkets\"></span></p></div>"},
{"title": "Solution Design & Development Analyst", "job_posted": "Aug 6, 2017", "job_location": "Brampton, ON, CA, L6T 0C1", "province_name": "ON", "job_detail": "<div class=\"job\"><span itemprop=\"description\"><div>Every day, we strive to build a brilliant digital future for Canadians. We work as one team, with one goal –serve our customers better.</div><div> </div><p>Rogers is seeking a seasoned Solution Design &amp; Development Analyst  expert to join our Data Management &amp; Technology team working out of Rogers Brampton &amp; Toronto Campuses. We are looking for individuals with exceptional business intelligence skills that possesses deep knowledge of the telecom industry to perform deep dive analyses to assist our stakeholders with delivering on strategic business decisions. Candidates must be able to work in a fast paced environment with changing priorities and ambiguity to deliver insightful analyses while working effectively in a collaborative manner with peers in IT, and across functional business groups.</p><p> </p><p><strong>Key Responsibilities:</strong></p><ul><li>Perform deep dive analyses into business requirements to define requirements maturity for the initiative objective &amp; scope</li><li>Consult with business partners to understand their requirements to proactively provide value added recommendations</li><li>Provide ad-hoc analysis/queries/reports from a wide variety of BI tools including MicroStrategy, OBIEE, Oracle data-mart tables, etc.</li><li>Must be able to extract data from multiple data sources to synthesize information that is actionable and fact driven</li><li>Ensure Data Management &amp; team delivers high quality analytical support throughout the lifecycle of projects and other engagements</li><li>Confirm solutions deliver value to stakeholders and adjust as required by running JAD sessions during the requirements gathering and clarification phase</li><li>Ensure Solution &amp; Design standards are aligned to organizational strategic objectives and departmental (DM&amp;T;) objectives by engaging the technical delivery team and architecture as required during the initiative lifecycle</li><li>Manage relationships with stakeholder groups with each interaction</li><li>Manage stakeholder expectation</li><li>Conduct review sessions with Architecture, Solution Design and Development and Operations (Production Support) resources as required during the SDS &amp; DDD phases</li></ul><p> </p><p><strong>Required Knowledge:</strong></p><ul><li>5 years of experience conducting business and /or financial analysis in the telecom/wireless industry</li><li>Extensive experience with business intelligence tools and concepts</li><li>Extensive experience consulting with business to translate business requirements into technical specifications, then into reports/dashboards for visualization</li></ul><p> </p><p><strong>Required Skills &amp; Abilities:</strong></p><ul><li>5 years of experience in Oracle databases using complex SQL scripting</li><li>Minimum of 3 years of experience with MicroStrategy, Tableau, Cognos or other BI tools</li><li>Quick learner with initiative and flexibility to deal with ambiguity</li><li>Proven analytical/business intelligence skills</li><li>Ability to work with large volume of data, translating business requirements into insightful information used to drive critical business decisions</li><li>Strong communication skills with experience working with stakeholders across the organization</li><li>Bias towards action oriented, flexible and adaptable</li><li>Ability to work in a fast paced environment with changing priorities</li><li>Oracle / SQL / Cognos / Microsoft SQL Server / SAS / MicroStrategy / Tableau</li></ul><p> </p><p><strong>Required Professional Designation/Certification:</strong></p><ul><li>Undergraduate Degree in Business, Mathematics or equivalent experience with exceptional knowledge of business intelligence tools</li><li>Prior consulting experience considered an asset</li></ul><p> </p><p><strong>Required Experience:</strong></p><ul><li>Telecom experience</li><li>Oracle / SQL / Cognos / Microsoft SQL Server / SAS</li></ul><p> </p><p><strong>Tools Sets &amp; Software Expertise</strong></p><ul><li>Cognos</li><li>Tableau</li><li>Control-M</li><li>Hadoop</li><li>Informatica</li><li>MicroStrategy</li><li>Oracle</li><li>OBIEE</li><li>Java</li><li>SQL</li><li>Unix</li></ul><div><p> </p><div><strong>Schedule:</strong> Full Time</div><div><strong>Shift:</strong> Day</div><div><strong>Length of Contract:</strong> Not Applicable (Regular Position)</div><div><strong>Work Location: </strong>8200 Dixie Road (101), Brampton, ON </div><div><strong>Travel Requirements:</strong> Up to 10%</div><div><strong>Posting Category/Function: </strong>Technology &amp; Information Technology</div><div><strong>Requisition ID:</strong> 101371</div><div> </div><div><b>WHY ROGERS?</b></div><div> </div><div>As a proud Canadian company, we're dedicated to making things easier for our customers. We’ve been embracing and leading change for over 50-years, and we’ll continue to seek out new opportunities to bring our customers simple solutions for today and tomorrow.</div><div> </div><div>Why Rogers? Because we believe the best is yet to come.</div><div> </div><div><p><em>We recognize the business value in creating a workplace where each team member has the tools to reach their full potential. At Rogers, we value the insights and innovation that diverse teams bring to work. We work with our candidates with disabilities throughout the recruitment process to ensure that they have what they need to be at their best. Please reach out to our recruiters and hiring managers to begin a conversation about how we can ensure that you deliver your best work. You can also reach out to our team at <a href=\"mailto:RogersRecruiting@rci.rogers.com\"><font color=\"#005887\">RogersRecruiting@rci.rogers.com</font></a> to begin a conversation about your individual accessibility needs throughout the hiring process.</em></p></div><div> </div><div>Posting Notes:  Corporate || Canada (CA) || ON || Brampton || SF:LI-KM1 ||</div></div></span><p class=\"job-location\"><span class=\"jobmarkets\"></span></p></div>"},
{"title": "Sales Associate  - Oakridge Fido", "job_posted": "Aug 7, 2017", "job_location": "Vancouver, BC, CA, V5Z 2M9", "province_name": "BC", "job_detail": "<div class=\"job\"><span itemprop=\"description\"><p>At Rogers we’re for supporting you on a journey to a rewarding career. Whether you’re a developer, an analyst, or a customer care consultant, Rogers is the place where ideas become reality. We embrace change, and find ways to do better. And we deliver on that commitment by fostering an environment of passion and innovation for all people.</p><p> </p><p>Our Sales Associates don’t just embrace the latest technology and content – it’s part of who they are. We want people on our team who are excited about our products and services and want to share their knowledge and experience with others. At Fido, retail has impact, and so can you.</p><p>We’re looking for outgoing, approachable sales associates with a proven track record in sales to join our Oakridge store on a part time basis. You’ll build and establish customer relationships, own the resolution of customer issues, and act as a Fido ambassador</p><p><b>Your Experience</b></p><ul><li>Proven success in a sales role, ideally within telecommunications, technology or retail</li><li>A sales professional with an ability to achieve individual sales targets</li><li>A passion for delivering exceptional customer service and sales experience</li><li>Tech savvy and eager to learn about technology and the telecom industry</li><li>An ability to think outside of the box and work in a fast-paced retail sales role</li><li>A proactive team player</li><li>Additional languages are an asset</li><li>An ability to work a varied and flexible schedule (20-30 hours per week, Monday – Sunday)</li></ul><p><b>Benefits for You</b></p><ul><li>Base hourly rate and competitive commission structure</li><li>Flexible schedule</li><li>Comprehensive health and dental plan for full time and part time employees</li><li>Outstanding share options and wealth accumulation programs</li><li>Employee discounts across Rogers &amp; Fido services</li><li>A company committed to investing in and developing our own talent</li><li>Employee recognition programs</li><li>Overtime pay eligible</li></ul><p><b>As part of the recruitment process, candidates will be required to provide consent for and successfully pass a criminal background check.</b></p><div> </div><div><b>Schedule:</b> Part Time</div><div><b>Shift:</b> Variable</div><div><b>Length of Contract:</b> Not Applicable (Regular Position)</div><div><b>Work Location: </b>650 West 41st Avenue, Unit 14a (5718), Vancouver, BC </div><div><b>Travel Requirements:</b> None</div><div><b>Posting Category/Function: </b>Retail (In Store / Hourly) &amp; Sales and Service</div><div><b>Requisition ID:</b> 104948</div><div> </div><div><b>WHY ROGERS?</b></div><div> </div><div>As a proud Canadian company, we're dedicated to making things easier for our customers. We’ve been embracing and leading change for over 50-years, and we’ll continue to seek out new opportunities to bring our customers simple solutions for today and tomorrow.</div><div> </div><div>We recognize that success is determined by the strength and diversity of our people. We work together because we want to win together, and these five shared values guide and define our work:</div><div> </div><ol><li>Simplify and innovate</li><li>Take ownership of the what and the how</li><li>Equip people to succeed</li><li>Execute with discipline and pride</li><li>Talk straight, build trust, and over deliver</li></ol><div> </div><div>Why Rogers?  Because your tomorrow inspires our today.</div><div> </div><div>What makes us different makes us stronger. Rogers has a strong commitment to diversity and inclusion. Everyone who applies for a job will be considered.</div><div> </div><div><i>We recognize the business value in creating a workplace where each team member has the tools to reach their full potential. At Rogers, we value the insights and innovation that diverse teams bring to work. We work with our candidates with disabilities throughout the recruitment process to ensure that they have what they need to be at their best. Please reach out to our recruiters and hiring managers to begin a conversation about how we can ensure that you deliver your best work. You can also reach out to our team at <a href=\"mailto:RogersRecruiting@rci.rogers.com\">RogersRecruiting@rci.rogers.com</a></i> to begin a conversation about your individual accessibility needs throughout the hiring process.</div><div> </div><div>Posting Notes:  Retail || Canada (CA) || BC || Vancouver || Retail ||</div><p> </p></span><p class=\"job-location\"><span class=\"jobmarkets\"></span></p></div>"},
{"title": "Sales Associate - Fido Northgate Centre", "job_posted": "Aug 7, 2017", "job_location": "Edmonton, AB, CA, T5E 5R8", "province_name": "AB", "job_detail": "<div class=\"job\"><span itemprop=\"description\"><p>At Rogers we’re for supporting you on a journey to a rewarding career. Whether you’re a developer, an analyst, or a customer care consultant, Rogers is the place where ideas become reality. We embrace change, and find ways to do better. And we deliver on that commitment by fostering an environment of passion and innovation for all people.</p><p> </p><p><strong>Sales Associate</strong></p><p>Our Sales Associates make every customer feel welcome and leave delighted, more knowledgeable, and feeling better about Rogers and Fido every time. They know how to engage, show they care and invest the time with our customers to get things done. They want every customer sharing their experience and always coming back.</p><p>At Rogers, retail has impact, and so can you.</p><p><strong>In this role you will:</strong></p><ul><li>Deliver a superior and consistent customer experience</li><li>Be the first to learn about new products and services</li><li>Handle all issues and concerns – you're the one-stop resolution for our customers</li><li>Meet and exceed monthly sales targets</li><li>Work in a fast-paced environment that requires a high degree of multi-tasking</li><li>Work with and through others to achieve team goals in a highly collaborative environment</li><li>Be able to work a varied and flexible schedules <strong>(Monday – Sunday)</strong></li></ul><p><strong>You are someone who: </strong></p><ul><li>Knows how to greet and thank our customers – you want everyone to feel welcome and appreciated</li><li>Has a knack for building rapport – you genuinely care about our customers’ needs. It’s not just about the sale!</li><li>Ensures our customers understand our products and services </li><li>Enjoys solving customer problems – you take accountability for their issues</li><li>Is comfortable taking action, showing initiative and feels empowered to lead</li><li>Takes pride in their work environment and wants to see the team succeed</li><li>Acts as a brand ambassador, an educator, a leader, a problem solver, and so much more!</li></ul><p><strong>Benefits for you:</strong></p><ul><li>We invest in you, just as much as you invest in us</li><li>Base hourly rate and competitive commission structure</li><li>Opportunities to grow and develop your career</li><li>Strong internal development programs</li><li>Comprehensive health and dental plan for full time and part time employees</li><li>Outstanding share options and wealth accumulation programs</li><li>Employee discounts across Rogers &amp; Fido services</li><li>Overtime pay eligible</li></ul><p>As part of the recruitment process, candidates will be required to provide consent for and successfully pass a criminal background check.</p><div> </div><div><b>Schedule:</b> Part Time</div><div><b>Shift:</b> Variable</div><div><b>Length of Contract:</b> Not Applicable (Regular Position)</div><div><b>Work Location: </b>9499 - 137TH AVE. NW UNIT K6 (5516), Edmonton, AB </div><div><b>Travel Requirements:</b> Up to 10%</div><div><b>Posting Category/Function: </b>Retail (In Store / Hourly) &amp; Sales and Service</div><div><b>Requisition ID:</b> 104049</div><div> </div><div><b>WHY ROGERS?</b></div><div> </div><div>As a proud Canadian company, we're dedicated to making things easier for our customers. We’ve been embracing and leading change for over 50-years, and we’ll continue to seek out new opportunities to bring our customers simple solutions for today and tomorrow.</div><div> </div><div>We recognize that success is determined by the strength and diversity of our people. We work together because we want to win together, and these five shared values guide and define our work:</div><div> </div><ol><li>Simplify and innovate</li><li>Take ownership of the what and the how</li><li>Equip people to succeed</li><li>Execute with discipline and pride</li><li>Talk straight, build trust, and over deliver</li></ol><div> </div><div>Why Rogers?  Because your tomorrow inspires our today.</div><div> </div><div>What makes us different makes us stronger. Rogers has a strong commitment to diversity and inclusion. Everyone who applies for a job will be considered.</div><div> </div><div><i>We recognize the business value in creating a workplace where each team member has the tools to reach their full potential. At Rogers, we value the insights and innovation that diverse teams bring to work. We work with our candidates with disabilities throughout the recruitment process to ensure that they have what they need to be at their best. Please reach out to our recruiters and hiring managers to begin a conversation about how we can ensure that you deliver your best work. You can also reach out to our team at <a href=\"mailto:RogersRecruiting@rci.rogers.com\">RogersRecruiting@rci.rogers.com</a></i> to begin a conversation about your individual accessibility needs throughout the hiring process.</div><div> </div><div>Posting Notes:  Retail || Canada (CA) || AB || Edmonton || Retail ||</div><p> </p></span><p class=\"job-location\"><span class=\"jobmarkets\"></span></p></div>"}
]